
<!DOCTYPE HTML>
<html lang="zh-hans" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>2. 请简要说说一个完整机器学习项目的流程 · machine-learning-interview-qa</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-expandable-chapters/expandable-chapters.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-splitter/splitter.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-page-footer-ex/style/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-prism/prism.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="3.html" />
    
    
    <link rel="prev" href="1.html" />
    

    <style>
    @media only screen and (max-width: 640px) {
        .book-header .hidden-mobile {
            display: none;
        }
    }
    </style>
    <script>
        window["gitbook-plugin-github-buttons"] = {"buttons":[{"user":"geekcircle","repo":"machine-learning-interview-qa","type":"star","size":"large"}]};
    </script>

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="输入并搜索" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    
    
        
        <li>
            <a href="https://geektutu.com/series" target="_blank" class="custom-link">极客兔兔的博客</a>
        </li>
    
        
        <li>
            <a href="https://github.com/geekcircle/machine-learning-interview-qa" target="_blank" class="custom-link">machine-learning-interview-qa</a>
        </li>
    
    

    
    <li class="divider"></li>
    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    序言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" >
            
                <span>
            
                    
                    题目
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.2.1" data-path="1.html">
            
                <a href="1.html">
            
                    
                    1. 如何处理特征向量的缺失值
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.2.2" data-path="2.html">
            
                <a href="2.html">
            
                    
                    2. 请简要说说一个完整机器学习项目的流程
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.3" data-path="3.html">
            
                <a href="3.html">
            
                    
                    3. 某超市研究销售记录发现买啤酒的人很大概率也会买尿布，这属于数据挖掘的哪类问题
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.4" data-path="4.html">
            
                <a href="4.html">
            
                    
                    4. 余弦相似与欧氏距离有什么区别和联系
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.5" data-path="5.html">
            
                <a href="5.html">
            
                    
                    5. 下面哪个不属于数据的属性类型
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.6" data-path="6.html">
            
                <a href="6.html">
            
                    
                    6. 监督学习和无监督学习
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.7" data-path="7.html">
            
                <a href="7.html">
            
                    
                    7. 熵是为消除不确定性所需要获得的信息量，投掷均匀正六面体骰子的熵是
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            本书使用 GitBook 发布
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >2. 请简要说说一个完整机器学习项目的流程</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="2-&#x8BF7;&#x7B80;&#x8981;&#x8BF4;&#x8BF4;&#x4E00;&#x4E2A;&#x5B8C;&#x6574;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x9879;&#x76EE;&#x7684;&#x6D41;&#x7A0B;">2. &#x8BF7;&#x7B80;&#x8981;&#x8BF4;&#x8BF4;&#x4E00;&#x4E2A;&#x5B8C;&#x6574;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x9879;&#x76EE;&#x7684;&#x6D41;&#x7A0B;</h1>
<h2 id="1-&#x62BD;&#x8C61;&#x6210;&#x6570;&#x5B66;&#x95EE;&#x9898;">1 &#x62BD;&#x8C61;&#x6210;&#x6570;&#x5B66;&#x95EE;&#x9898;</h2>
<p>&#x660E;&#x786E;&#x95EE;&#x9898;&#x662F;&#x8FDB;&#x884C;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x7684;&#x7B2C;&#x4E00;&#x6B65;&#x3002;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x7684;&#x8BAD;&#x7EC3;&#x8FC7;&#x7A0B;&#x901A;&#x5E38;&#x90FD;&#x662F;&#x4E00;&#x4EF6;&#x975E;&#x5E38;&#x8017;&#x65F6;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x80E1;&#x4E71;&#x5C1D;&#x8BD5;&#x65F6;&#x95F4;&#x6210;&#x672C;&#x662F;&#x975E;&#x5E38;&#x9AD8;&#x7684;&#x3002;
&#x8FD9;&#x91CC;&#x7684;&#x62BD;&#x8C61;&#x6210;&#x6570;&#x5B66;&#x95EE;&#x9898;&#xFF0C;&#x6307;&#x7684;&#x6211;&#x4EEC;&#x660E;&#x786E;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x83B7;&#x5F97;&#x4EC0;&#x4E48;&#x6837;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x76EE;&#x6807;&#x662F;&#x4E00;&#x4E2A;&#x5206;&#x7C7B;&#x8FD8;&#x662F;&#x56DE;&#x5F52;&#x6216;&#x8005;&#x662F;&#x805A;&#x7C7B;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x5982;&#x679C;&#x90FD;&#x4E0D;&#x662F;&#x7684;&#x8BDD;&#xFF0C;&#x5982;&#x679C;&#x5212;&#x5F52;&#x4E3A;&#x5176;&#x4E2D;&#x7684;&#x67D0;&#x7C7B;&#x95EE;&#x9898;&#x3002;</p>
<h2 id="2-&#x83B7;&#x53D6;&#x6570;&#x636E;">2 &#x83B7;&#x53D6;&#x6570;&#x636E;</h2>
<p>&#x6570;&#x636E;&#x51B3;&#x5B9A;&#x4E86;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x7ED3;&#x679C;&#x7684;&#x4E0A;&#x9650;&#xFF0C;&#x800C;&#x7B97;&#x6CD5;&#x53EA;&#x662F;&#x5C3D;&#x53EF;&#x80FD;&#x903C;&#x8FD1;&#x8FD9;&#x4E2A;&#x4E0A;&#x9650;&#x3002;
&#x6570;&#x636E;&#x8981;&#x6709;&#x4EE3;&#x8868;&#x6027;&#xFF0C;&#x5426;&#x5219;&#x5FC5;&#x7136;&#x4F1A;&#x8FC7;&#x62DF;&#x5408;&#x3002;
&#x800C;&#x4E14;&#x5BF9;&#x4E8E;&#x5206;&#x7C7B;&#x95EE;&#x9898;&#xFF0C;&#x6570;&#x636E;&#x504F;&#x659C;&#x4E0D;&#x80FD;&#x8FC7;&#x4E8E;&#x4E25;&#x91CD;&#xFF0C;&#x4E0D;&#x540C;&#x7C7B;&#x522B;&#x7684;&#x6570;&#x636E;&#x6570;&#x91CF;&#x4E0D;&#x8981;&#x6709;&#x6570;&#x4E2A;&#x6570;&#x91CF;&#x7EA7;&#x7684;&#x5DEE;&#x8DDD;&#x3002;
&#x800C;&#x4E14;&#x8FD8;&#x8981;&#x5BF9;&#x6570;&#x636E;&#x7684;&#x91CF;&#x7EA7;&#x6709;&#x4E00;&#x4E2A;&#x8BC4;&#x4F30;&#xFF0C;&#x591A;&#x5C11;&#x4E2A;&#x6837;&#x672C;&#xFF0C;&#x591A;&#x5C11;&#x4E2A;&#x7279;&#x5F81;&#xFF0C;&#x53EF;&#x4EE5;&#x4F30;&#x7B97;&#x51FA;&#x5176;&#x5BF9;&#x5185;&#x5B58;&#x7684;&#x6D88;&#x8017;&#x7A0B;&#x5EA6;&#xFF0C;&#x5224;&#x65AD;&#x8BAD;&#x7EC3;&#x8FC7;&#x7A0B;&#x4E2D;&#x5185;&#x5B58;&#x662F;&#x5426;&#x80FD;&#x591F;&#x653E;&#x5F97;&#x4E0B;&#x3002;&#x5982;&#x679C;&#x653E;&#x4E0D;&#x4E0B;&#x5C31;&#x5F97;&#x8003;&#x8651;&#x6539;&#x8FDB;&#x7B97;&#x6CD5;&#x6216;&#x8005;&#x4F7F;&#x7528;&#x4E00;&#x4E9B;&#x964D;&#x7EF4;&#x7684;&#x6280;&#x5DE7;&#x4E86;&#x3002;&#x5982;&#x679C;&#x6570;&#x636E;&#x91CF;&#x5B9E;&#x5728;&#x592A;&#x5927;&#xFF0C;&#x90A3;&#x5C31;&#x8981;&#x8003;&#x8651;&#x5206;&#x5E03;&#x5F0F;&#x4E86;&#x3002;</p>
<h2 id="3-&#x7279;&#x5F81;&#x9884;&#x5904;&#x7406;&#x4E0E;&#x7279;&#x5F81;&#x9009;&#x62E9;">3 &#x7279;&#x5F81;&#x9884;&#x5904;&#x7406;&#x4E0E;&#x7279;&#x5F81;&#x9009;&#x62E9;</h2>
<p>&#x826F;&#x597D;&#x7684;&#x6570;&#x636E;&#x8981;&#x80FD;&#x591F;&#x63D0;&#x53D6;&#x51FA;&#x826F;&#x597D;&#x7684;&#x7279;&#x5F81;&#x624D;&#x80FD;&#x771F;&#x6B63;&#x53D1;&#x6325;&#x6548;&#x529B;&#x3002;
&#x7279;&#x5F81;&#x9884;&#x5904;&#x7406;&#x3001;&#x6570;&#x636E;&#x6E05;&#x6D17;&#x662F;&#x5F88;&#x5173;&#x952E;&#x7684;&#x6B65;&#x9AA4;&#xFF0C;&#x5F80;&#x5F80;&#x80FD;&#x591F;&#x4F7F;&#x5F97;&#x7B97;&#x6CD5;&#x7684;&#x6548;&#x679C;&#x548C;&#x6027;&#x80FD;&#x5F97;&#x5230;&#x663E;&#x8457;&#x63D0;&#x9AD8;&#x3002;&#x5F52;&#x4E00;&#x5316;&#x3001;&#x79BB;&#x6563;&#x5316;&#x3001;&#x56E0;&#x5B50;&#x5316;&#x3001;&#x7F3A;&#x5931;&#x503C;&#x5904;&#x7406;&#x3001;&#x53BB;&#x9664;&#x5171;&#x7EBF;&#x6027;&#x7B49;&#xFF0C;&#x6570;&#x636E;&#x6316;&#x6398;&#x8FC7;&#x7A0B;&#x4E2D;&#x5F88;&#x591A;&#x65F6;&#x95F4;&#x5C31;&#x82B1;&#x5728;&#x5B83;&#x4EEC;&#x4E0A;&#x9762;&#x3002;&#x8FD9;&#x4E9B;&#x5DE5;&#x4F5C;&#x7B80;&#x5355;&#x53EF;&#x590D;&#x5236;&#xFF0C;&#x6536;&#x76CA;&#x7A33;&#x5B9A;&#x53EF;&#x9884;&#x671F;&#xFF0C;&#x662F;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x7684;&#x57FA;&#x7840;&#x5FC5;&#x5907;&#x6B65;&#x9AA4;&#x3002;
&#x7B5B;&#x9009;&#x51FA;&#x663E;&#x8457;&#x7279;&#x5F81;&#x3001;&#x6452;&#x5F03;&#x975E;&#x663E;&#x8457;&#x7279;&#x5F81;&#xFF0C;&#x9700;&#x8981;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x5DE5;&#x7A0B;&#x5E08;&#x53CD;&#x590D;&#x7406;&#x89E3;&#x4E1A;&#x52A1;&#x3002;&#x8FD9;&#x5BF9;&#x5F88;&#x591A;&#x7ED3;&#x679C;&#x6709;&#x51B3;&#x5B9A;&#x6027;&#x7684;&#x5F71;&#x54CD;&#x3002;&#x7279;&#x5F81;&#x9009;&#x62E9;&#x597D;&#x4E86;&#xFF0C;&#x975E;&#x5E38;&#x7B80;&#x5355;&#x7684;&#x7B97;&#x6CD5;&#x4E5F;&#x80FD;&#x5F97;&#x51FA;&#x826F;&#x597D;&#x3001;&#x7A33;&#x5B9A;&#x7684;&#x7ED3;&#x679C;&#x3002;&#x8FD9;&#x9700;&#x8981;&#x8FD0;&#x7528;&#x7279;&#x5F81;&#x6709;&#x6548;&#x6027;&#x5206;&#x6790;&#x7684;&#x76F8;&#x5173;&#x6280;&#x672F;&#xFF0C;&#x5982;&#x76F8;&#x5173;&#x7CFB;&#x6570;&#x3001;&#x5361;&#x65B9;&#x68C0;&#x9A8C;&#x3001;&#x5E73;&#x5747;&#x4E92;&#x4FE1;&#x606F;&#x3001;&#x6761;&#x4EF6;&#x71B5;&#x3001;&#x540E;&#x9A8C;&#x6982;&#x7387;&#x3001;&#x903B;&#x8F91;&#x56DE;&#x5F52;&#x6743;&#x91CD;&#x7B49;&#x65B9;&#x6CD5;&#x3002;</p>
<h2 id="4-&#x8BAD;&#x7EC3;&#x6A21;&#x578B;&#x4E0E;&#x8C03;&#x4F18;">4 &#x8BAD;&#x7EC3;&#x6A21;&#x578B;&#x4E0E;&#x8C03;&#x4F18;</h2>
<p>&#x76F4;&#x5230;&#x8FD9;&#x4E00;&#x6B65;&#x624D;&#x7528;&#x5230;&#x6211;&#x4EEC;&#x4E0A;&#x9762;&#x8BF4;&#x7684;&#x7B97;&#x6CD5;&#x8FDB;&#x884C;&#x8BAD;&#x7EC3;&#x3002;&#x73B0;&#x5728;&#x5F88;&#x591A;&#x7B97;&#x6CD5;&#x90FD;&#x80FD;&#x591F;&#x5C01;&#x88C5;&#x6210;&#x9ED1;&#x76D2;&#x4F9B;&#x4EBA;&#x4F7F;&#x7528;&#x3002;&#x4F46;&#x662F;&#x771F;&#x6B63;&#x8003;&#x9A8C;&#x6C34;&#x5E73;&#x7684;&#x662F;&#x8C03;&#x6574;&#x8FD9;&#x4E9B;&#x7B97;&#x6CD5;&#x7684;&#xFF08;&#x8D85;&#xFF09;&#x53C2;&#x6570;&#xFF0C;&#x4F7F;&#x5F97;&#x7ED3;&#x679C;&#x53D8;&#x5F97;&#x66F4;&#x52A0;&#x4F18;&#x826F;&#x3002;&#x8FD9;&#x9700;&#x8981;&#x6211;&#x4EEC;&#x5BF9;&#x7B97;&#x6CD5;&#x7684;&#x539F;&#x7406;&#x6709;&#x6DF1;&#x5165;&#x7684;&#x7406;&#x89E3;&#x3002;&#x7406;&#x89E3;&#x8D8A;&#x6DF1;&#x5165;&#xFF0C;&#x5C31;&#x8D8A;&#x80FD;&#x53D1;&#x73B0;&#x95EE;&#x9898;&#x7684;&#x75C7;&#x7ED3;&#xFF0C;&#x63D0;&#x51FA;&#x826F;&#x597D;&#x7684;&#x8C03;&#x4F18;&#x65B9;&#x6848;&#x3002;</p>
<h2 id="5-&#x6A21;&#x578B;&#x8BCA;&#x65AD;">5 &#x6A21;&#x578B;&#x8BCA;&#x65AD;</h2>
<p>&#x5982;&#x4F55;&#x786E;&#x5B9A;&#x6A21;&#x578B;&#x8C03;&#x4F18;&#x7684;&#x65B9;&#x5411;&#x4E0E;&#x601D;&#x8DEF;&#x5462;&#xFF1F;&#x8FD9;&#x5C31;&#x9700;&#x8981;&#x5BF9;&#x6A21;&#x578B;&#x8FDB;&#x884C;&#x8BCA;&#x65AD;&#x7684;&#x6280;&#x672F;&#x3002;
&#x8FC7;&#x62DF;&#x5408;&#x3001;&#x6B20;&#x62DF;&#x5408; &#x5224;&#x65AD;&#x662F;&#x6A21;&#x578B;&#x8BCA;&#x65AD;&#x4E2D;&#x81F3;&#x5173;&#x91CD;&#x8981;&#x7684;&#x4E00;&#x6B65;&#x3002;&#x5E38;&#x89C1;&#x7684;&#x65B9;&#x6CD5;&#x5982;&#x4EA4;&#x53C9;&#x9A8C;&#x8BC1;&#xFF0C;&#x7ED8;&#x5236;&#x5B66;&#x4E60;&#x66F2;&#x7EBF;&#x7B49;&#x3002;&#x8FC7;&#x62DF;&#x5408;&#x7684;&#x57FA;&#x672C;&#x8C03;&#x4F18;&#x601D;&#x8DEF;&#x662F;&#x589E;&#x52A0;&#x6570;&#x636E;&#x91CF;&#xFF0C;&#x964D;&#x4F4E;&#x6A21;&#x578B;&#x590D;&#x6742;&#x5EA6;&#x3002;&#x6B20;&#x62DF;&#x5408;&#x7684;&#x57FA;&#x672C;&#x8C03;&#x4F18;&#x601D;&#x8DEF;&#x662F;&#x63D0;&#x9AD8;&#x7279;&#x5F81;&#x6570;&#x91CF;&#x548C;&#x8D28;&#x91CF;&#xFF0C;&#x589E;&#x52A0;&#x6A21;&#x578B;&#x590D;&#x6742;&#x5EA6;&#x3002;
&#x8BEF;&#x5DEE;&#x5206;&#x6790; &#x4E5F;&#x662F;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x81F3;&#x5173;&#x91CD;&#x8981;&#x7684;&#x6B65;&#x9AA4;&#x3002;&#x901A;&#x8FC7;&#x89C2;&#x5BDF;&#x8BEF;&#x5DEE;&#x6837;&#x672C;&#xFF0C;&#x5168;&#x9762;&#x5206;&#x6790;&#x8BEF;&#x5DEE;&#x4EA7;&#x751F;&#x8BEF;&#x5DEE;&#x7684;&#x539F;&#x56E0;:&#x662F;&#x53C2;&#x6570;&#x7684;&#x95EE;&#x9898;&#x8FD8;&#x662F;&#x7B97;&#x6CD5;&#x9009;&#x62E9;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x662F;&#x7279;&#x5F81;&#x7684;&#x95EE;&#x9898;&#x8FD8;&#x662F;&#x6570;&#x636E;&#x672C;&#x8EAB;&#x7684;&#x95EE;&#x9898;&#x2026;&#x2026;
&#x8BCA;&#x65AD;&#x540E;&#x7684;&#x6A21;&#x578B;&#x9700;&#x8981;&#x8FDB;&#x884C;&#x8C03;&#x4F18;&#xFF0C;&#x8C03;&#x4F18;&#x540E;&#x7684;&#x65B0;&#x6A21;&#x578B;&#x9700;&#x8981;&#x91CD;&#x65B0;&#x8FDB;&#x884C;&#x8BCA;&#x65AD;&#xFF0C;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x53CD;&#x590D;&#x8FED;&#x4EE3;&#x4E0D;&#x65AD;&#x903C;&#x8FD1;&#x7684;&#x8FC7;&#x7A0B;&#xFF0C;&#x9700;&#x8981;&#x4E0D;&#x65AD;&#x5730;&#x5C1D;&#x8BD5;&#xFF0C; &#x8FDB;&#x800C;&#x8FBE;&#x5230;&#x6700;&#x4F18;&#x72B6;&#x6001;&#x3002;</p>
<h2 id="6-&#x6A21;&#x578B;&#x878D;&#x5408;">6 &#x6A21;&#x578B;&#x878D;&#x5408;</h2>
<p>&#x4E00;&#x822C;&#x6765;&#x8BF4;&#xFF0C;&#x6A21;&#x578B;&#x878D;&#x5408;&#x540E;&#x90FD;&#x80FD;&#x4F7F;&#x5F97;&#x6548;&#x679C;&#x6709;&#x4E00;&#x5B9A;&#x63D0;&#x5347;&#x3002;&#x800C;&#x4E14;&#x6548;&#x679C;&#x5F88;&#x597D;&#x3002;
&#x5DE5;&#x7A0B;&#x4E0A;&#xFF0C;&#x4E3B;&#x8981;&#x63D0;&#x5347;&#x7B97;&#x6CD5;&#x51C6;&#x786E;&#x5EA6;&#x7684;&#x65B9;&#x6CD5;&#x662F;&#x5206;&#x522B;&#x5728;&#x6A21;&#x578B;&#x7684;&#x524D;&#x7AEF;&#xFF08;&#x7279;&#x5F81;&#x6E05;&#x6D17;&#x548C;&#x9884;&#x5904;&#x7406;&#xFF0C;&#x4E0D;&#x540C;&#x7684;&#x91C7;&#x6837;&#x6A21;&#x5F0F;&#xFF09;&#x4E0E;&#x540E;&#x7AEF;&#xFF08;&#x6A21;&#x578B;&#x878D;&#x5408;&#xFF09;&#x4E0A;&#x4E0B;&#x529F;&#x592B;&#x3002;&#x56E0;&#x4E3A;&#x4ED6;&#x4EEC;&#x6BD4;&#x8F83;&#x6807;&#x51C6;&#x53EF;&#x590D;&#x5236;&#xFF0C;&#x6548;&#x679C;&#x6BD4;&#x8F83;&#x7A33;&#x5B9A;&#x3002;&#x800C;&#x76F4;&#x63A5;&#x8C03;&#x53C2;&#x7684;&#x5DE5;&#x4F5C;&#x4E0D;&#x4F1A;&#x5F88;&#x591A;&#xFF0C;&#x6BD5;&#x7ADF;&#x5927;&#x91CF;&#x6570;&#x636E;&#x8BAD;&#x7EC3;&#x8D77;&#x6765;&#x592A;&#x6162;&#x4E86;&#xFF0C;&#x800C;&#x4E14;&#x6548;&#x679C;&#x96BE;&#x4EE5;&#x4FDD;&#x8BC1;&#x3002;</p>
<h2 id="7-&#x4E0A;&#x7EBF;&#x8FD0;&#x884C;">7 &#x4E0A;&#x7EBF;&#x8FD0;&#x884C;</h2>
<p>&#x8FD9;&#x4E00;&#x90E8;&#x5206;&#x5185;&#x5BB9;&#x4E3B;&#x8981;&#x8DDF;&#x5DE5;&#x7A0B;&#x5B9E;&#x73B0;&#x7684;&#x76F8;&#x5173;&#x6027;&#x6BD4;&#x8F83;&#x5927;&#x3002;&#x5DE5;&#x7A0B;&#x4E0A;&#x662F;&#x7ED3;&#x679C;&#x5BFC;&#x5411;&#xFF0C;&#x6A21;&#x578B;&#x5728;&#x7EBF;&#x4E0A;&#x8FD0;&#x884C;&#x7684;&#x6548;&#x679C;&#x76F4;&#x63A5;&#x51B3;&#x5B9A;&#x6A21;&#x578B;&#x7684;&#x6210;&#x8D25;&#x3002; &#x4E0D;&#x5355;&#x7EAF;&#x5305;&#x62EC;&#x5176;&#x51C6;&#x786E;&#x7A0B;&#x5EA6;&#x3001;&#x8BEF;&#x5DEE;&#x7B49;&#x60C5;&#x51B5;&#xFF0C;&#x8FD8;&#x5305;&#x62EC;&#x5176;&#x8FD0;&#x884C;&#x7684;&#x901F;&#x5EA6;(&#x65F6;&#x95F4;&#x590D;&#x6742;&#x5EA6;)&#x3001;&#x8D44;&#x6E90;&#x6D88;&#x8017;&#x7A0B;&#x5EA6;&#xFF08;&#x7A7A;&#x95F4;&#x590D;&#x6742;&#x5EA6;&#xFF09;&#x3001;&#x7A33;&#x5B9A;&#x6027;&#x662F;&#x5426;&#x53EF;&#x63A5;&#x53D7;&#x3002;
&#x8FD9;&#x4E9B;&#x5DE5;&#x4F5C;&#x6D41;&#x7A0B;&#x4E3B;&#x8981;&#x662F;&#x5DE5;&#x7A0B;&#x5B9E;&#x8DF5;&#x4E0A;&#x603B;&#x7ED3;&#x51FA;&#x7684;&#x4E00;&#x4E9B;&#x7ECF;&#x9A8C;&#x3002;&#x5E76;&#x4E0D;&#x662F;&#x6BCF;&#x4E2A;&#x9879;&#x76EE;&#x90FD;&#x5305;&#x542B;&#x5B8C;&#x6574;&#x7684;&#x4E00;&#x4E2A;&#x6D41;&#x7A0B;&#x3002;&#x8FD9;&#x91CC;&#x7684;&#x90E8;&#x5206;&#x53EA;&#x662F;&#x4E00;&#x4E2A;&#x6307;&#x5BFC;&#x6027;&#x7684;&#x8BF4;&#x660E;&#xFF0C;&#x53EA;&#x6709;&#x5927;&#x5BB6;&#x81EA;&#x5DF1;&#x591A;&#x5B9E;&#x8DF5;&#xFF0C;&#x591A;&#x79EF;&#x7D2F;&#x9879;&#x76EE;&#x7ECF;&#x9A8C;&#xFF0C;&#x624D;&#x4F1A;&#x6709;&#x81EA;&#x5DF1;&#x66F4;&#x6DF1;&#x523B;&#x7684;&#x8BA4;&#x8BC6;&#x3002;</p>
<footer class="page-footer-ex"> <span class="page-footer-ex-copyright"> <a href="https://github.com/geekcircle" target="_blank">geekcircle</a> </span> &#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; <span class="page-footer-ex-footer-update"> <strong>updated</strong> 2018-05-16 22:25:29 </span> </footer>
                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="1.html" class="navigation navigation-prev " aria-label="Previous page: 1. 如何处理特征向量的缺失值">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="3.html" class="navigation navigation-next " aria-label="Next page: 3. 某超市研究销售记录发现买啤酒的人很大概率也会买尿布，这属于数据挖掘的哪类问题">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"2. 请简要说说一个完整机器学习项目的流程","level":"1.2.2","depth":2,"next":{"title":"3. 某超市研究销售记录发现买啤酒的人很大概率也会买尿布，这属于数据挖掘的哪类问题","level":"1.2.3","depth":2,"path":"questions/3.md","ref":"questions/3.md","articles":[]},"previous":{"title":"1. 如何处理特征向量的缺失值","level":"1.2.1","depth":2,"path":"questions/1.md","ref":"questions/1.md","articles":[]},"dir":"ltr"},"config":{"plugins":["-highlight","expandable-chapters","splitter","page-footer-ex","prism","github","github-buttons","sitemap-general","livereload"],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"prism":{},"github":{"url":"https://github.com/geekcircle/machine-learning-interview-qa"},"livereload":{},"page-footer-ex":{"copyright":"[geekcircle](https://github.com/geekcircle)","markdown":true,"update_format":"YYYY-MM-DD HH:mm:ss","update_label":"<strong>updated</strong>"},"splitter":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sitemap-general":{"prefix":"https://geekcircle.github.io/machine-learning-interview-qa/"},"fontsettings":{"theme":"white","family":"sans","size":2},"github-buttons":{"buttons":[{"user":"geekcircle","repo":"machine-learning-interview-qa","type":"star","size":"large"}]},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false},"expandable-chapters":{}},"theme":"default","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"machine-learning-interview-qa","language":"zh-hans","links":{"sidebar":{"极客兔兔的博客":"https://geektutu.com/series","machine-learning-interview-qa":"https://github.com/geekcircle/machine-learning-interview-qa"}},"gitbook":"*","description":"stackoverflow上票数最高的100个问题"},"file":{"path":"questions/2.md","mtime":"2018-05-16T14:25:29.000Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2018-05-23T15:38:59.023Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-expandable-chapters/expandable-chapters.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-splitter/splitter.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-github/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-github-buttons/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-livereload/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

