
<!DOCTYPE HTML>
<html lang="zh-hans" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>5. 下面哪个不属于数据的属性类型 · 机器学习面试笔试题 - 极客圈</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-expandable-chapters/expandable-chapters.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-splitter/splitter.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-page-footer-ex/style/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-prism/prism.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="6.html" />
    
    
    <link rel="prev" href="4.html" />
    

    <style>
    @media only screen and (max-width: 640px) {
        .book-header .hidden-mobile {
            display: none;
        }
    }
    </style>
    <script>
        window["gitbook-plugin-github-buttons"] = {"buttons":[{"user":"geekcircle","repo":"machine-learning-interview-qa","type":"star","size":"large"}]};
    </script>

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="输入并搜索" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    
    
        
        <li>
            <a href="https://geektutu.com/series" target="_blank" class="custom-link">极客兔兔的博客</a>
        </li>
    
        
        <li>
            <a href="https://github.com/geekcircle/machine-learning-interview-qa" target="_blank" class="custom-link">machine-learning-interview-qa</a>
        </li>
    
    

    
    <li class="divider"></li>
    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    序言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" >
            
                <span>
            
                    
                    题目
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.2.1" data-path="1.html">
            
                <a href="1.html">
            
                    
                    1. 如何处理特征向量的缺失值
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.2" data-path="2.html">
            
                <a href="2.html">
            
                    
                    2. 请简要说说一个完整机器学习项目的流程
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.3" data-path="3.html">
            
                <a href="3.html">
            
                    
                    3. 某超市研究销售记录发现买啤酒的人很大概率也会买尿布，这属于数据挖掘的哪类问题
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.4" data-path="4.html">
            
                <a href="4.html">
            
                    
                    4. 余弦相似与欧氏距离有什么区别和联系
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.2.5" data-path="5.html">
            
                <a href="5.html">
            
                    
                    5. 下面哪个不属于数据的属性类型
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.6" data-path="6.html">
            
                <a href="6.html">
            
                    
                    6. 监督学习和无监督学习
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.7" data-path="7.html">
            
                <a href="7.html">
            
                    
                    7. 熵是为消除不确定性所需要获得的信息量，投掷均匀正六面体骰子的熵是
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.8" data-path="8.html">
            
                <a href="8.html">
            
                    
                    8. 数据清洗与特征处理
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.9" data-path="9.html">
            
                <a href="9.html">
            
                    
                    9. 猜测这种划分最可能是什么聚类算法的结果
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.10" data-path="10.html">
            
                <a href="10.html">
            
                    
                    10. 支持向量机(SVM)中的支持向量是什么意思
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.11" data-path="11.html">
            
                <a href="11.html">
            
                    
                    11. 精确率（precision）和召回率（recall）
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            本书使用 GitBook 发布
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >5. 下面哪个不属于数据的属性类型</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="5-&#x4E0B;&#x9762;&#x54EA;&#x4E2A;&#x4E0D;&#x5C5E;&#x4E8E;&#x6570;&#x636E;&#x7684;&#x5C5E;&#x6027;&#x7C7B;&#x522B;">5. &#x4E0B;&#x9762;&#x54EA;&#x4E2A;&#x4E0D;&#x5C5E;&#x4E8E;&#x6570;&#x636E;&#x7684;&#x5C5E;&#x6027;&#x7C7B;&#x522B;</h1>
<h3 id="a-&#x6807;&#x79F0;">A &#x6807;&#x79F0;</h3>
<h3 id="b-&#x5E8F;&#x6570;">B &#x5E8F;&#x6570;</h3>
<h3 id="c-&#x533A;&#x95F4;">C &#x533A;&#x95F4;</h3>
<h3 id="d-&#x76F8;&#x5F02;">D &#x76F8;&#x5F02;</h3>
<h2 id="&#x5173;&#x4E8E;&#x6570;&#x636E;&#x7684;&#x5C5E;&#x6027;&#x7C7B;&#x522B;&#x7684;&#x4ECB;&#x7ECD;">&#x5173;&#x4E8E;&#x6570;&#x636E;&#x7684;&#x5C5E;&#x6027;&#x7C7B;&#x522B;&#x7684;&#x4ECB;&#x7ECD;</h2>
<p>&#x6570;&#x636E;&#x96C6;&#x7531;&#x6570;&#x636E;&#x5BF9;&#x8C61;&#x7EC4;&#x6210;&#xFF0C;&#x4E00;&#x4E2A;&#x6570;&#x636E;&#x5BF9;&#x8C61;&#x4EE3;&#x8868;&#x4E00;&#x4E2A;&#x5B9E;&#x4F53;&#x3002;&#x6570;&#x636E;&#x5BF9;&#x8C61;&#x53C8;&#x79F0;&#x6837;&#x672C;&#x3001;&#x5B9E;&#x4F8B;&#x3001;&#x6570;&#x636E;&#x70B9;&#x6216;&#x5BF9;&#x8C61;&#x3002;&#x5C5E;&#x6027;&#xFF08;attribute&#xFF09;&#x662F;&#x4E00;&#x4E2A;&#x6570;&#x636E;&#x5B57;&#x6BB5;&#xFF0C;&#x8868;&#x793A;&#x6570;&#x636E;&#x5BF9;&#x8C61;&#x7684;&#x4E00;&#x4E2A;&#x7279;&#x5F81;&#x3002;&#x5C5E;&#x6027;&#x5411;&#x91CF;&#xFF08;&#x6216;&#x7279;&#x5F81;&#x5411;&#x91CF;&#xFF09;&#x662F;&#x7528;&#x6765;&#x63CF;&#x8FF0;&#x4E00;&#x4E2A;&#x7ED9;&#x5B9A;&#x5BF9;&#x8C61;&#x7684;&#x4E00;&#x7EC4;&#x5C5E;&#x6027;&#x3002;&#x5C5E;&#x6027;&#x6709;&#x4E0D;&#x540C;&#x7C7B;&#x578B;&#xFF1A;&#x6807;&#x79F0;&#x5C5E;&#x6027;&#xFF08;nominal attribute&#xFF09;&#x3001;&#x4E8C;&#x5143;&#x5C5E;&#x6027;&#xFF08;binary attribute&#xFF09;&#x3001;&#x5E8F;&#x6570;&#x5C5E;&#x6027;&#xFF08;ordinal attribute&#xFF09;&#x3001; &#x6570;&#x503C;&#x5C5E;&#x6027;&#xFF08;numerical attribute&#xFF09;&#x3001;&#x79BB;&#x6563;&#x5C5E;&#x6027;&#x4E0E;&#x8FDE;&#x7EED;&#x5C5E;&#x6027;&#x3002;</p>
<h3 id="a&#x3001;&#x6807;&#x79F0;&#x5C5E;&#x6027;&#xFF08;nominal-attribute&#xFF09;">A&#x3001;&#x6807;&#x79F0;&#x5C5E;&#x6027;&#xFF08;nominal attribute&#xFF09;</h3>
<p>&#x6807;&#x79F0;&#x5C5E;&#x6027;&#x7684;&#x503C;&#x662F;&#x4E00;&#x4E9B;&#x7B26;&#x53F7;&#x6216;&#x5B9E;&#x7269;&#x7684;&#x540D;&#x79F0;&#xFF0C;&#x6BCF;&#x4E2A;&#x503C;&#x4EE3;&#x8868;&#x67D0;&#x79CD;&#x7C7B;&#x522B;&#x3001;&#x7F16;&#x7801;&#x6216;&#x72B6;&#x6001;&#xFF0C;&#x6240;&#x4EE5;&#x6807;&#x79F0;&#x5C5E;&#x6027;&#x53C8;&#x88AB;&#x770B;&#x505A;&#x662F;&#x5206;&#x7C7B;&#x578B;&#x7684;&#x5C5E;&#x6027;&#xFF08;categorical&#xFF09;&#x3002;&#x8FD9;&#x4E9B;&#x503C;&#x4E0D;&#x5FC5;&#x5177;&#x6709;&#x6709;&#x610F;&#x4E49;&#x7684;&#x5E8F;&#xFF0C;&#x5E76;&#x4E14;&#x4E0D;&#x662F;&#x5B9A;&#x91CF;&#x7684;&#x3002;</p>
<h3 id="b&#x3001;&#x4E8C;&#x5143;&#x5C5E;&#x6027;&#xFF08;binary-attribute&#xFF09;">B&#x3001;&#x4E8C;&#x5143;&#x5C5E;&#x6027;&#xFF08;binary attribute&#xFF09;</h3>
<p>&#x4E8C;&#x5143;&#x5C5E;&#x6027;&#x662F;&#x4E00;&#x79CD;&#x6807;&#x79F0;&#x5C5E;&#x6027;&#xFF0C;&#x53EA;&#x6709;&#x4E24;&#x4E2A;&#x7C7B;&#x522B;&#x6216;&#x72B6;&#x6001;&#xFF1A;0&#x6216;1&#xFF0C;&#x5176;&#x4E2D;0&#x5E38;&#x8868;&#x793A;&#x4E0D;&#x51FA;&#x73B0;&#xFF0C;1&#x8868;&#x793A;&#x51FA;&#x73B0;&#x3002;&#x5982;&#x679C;&#x5C06;0&#x548C;1&#x5BF9;&#x5E94;&#x4E8E;false&#x548C;true&#xFF0C;&#x4E8C;&#x5143;&#x5C5E;&#x6027;&#x5219;&#x4E3A;&#x5E03;&#x5C14;&#x5C5E;&#x6027;&#x3002;</p>
<h3 id="c&#x3001;&#x5E8F;&#x6570;&#x5C5E;&#x6027;&#xFF08;ordinal-attribute&#xFF09;">C&#x3001;&#x5E8F;&#x6570;&#x5C5E;&#x6027;&#xFF08;ordinal attribute&#xFF09;</h3>
<p>&#x5E8F;&#x6570;&#x5C5E;&#x6027;&#x53EF;&#x80FD;&#x7684;&#x53D6;&#x503C;&#x4E4B;&#x95F4;&#x5177;&#x6709;&#x6709;&#x610F;&#x4E49;&#x7684;&#x5E8F;&#x6216;&#x79E9;&#x8BC4;&#x5B9A;&#xFF0C;&#x4F46;&#x76F8;&#x7EE7;&#x503C;&#x4E4B;&#x95F4;&#x7684;&#x5DEE;&#x662F;&#x672A;&#x77E5;&#x7684;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5B66;&#x751F;&#x7684;&#x6210;&#x7EE9;&#x5C5E;&#x6027;&#x53EF;&#x4EE5;&#x5206;&#x4E3A;&#x4F18;&#x3001;&#x826F;&#x3001;&#x4E2D;&#x3001;&#x5DEE;&#x56DB;&#x4E2A;&#x7B49;&#x7EA7;&#xFF1B;&#x67D0;&#x5FEB;&#x9910;&#x5E97;&#x7684;&#x996E;&#x6599;&#x676F;&#x5177;&#x6709;&#x5927;&#x3001;&#x4E2D;&#x3001;&#x5C0F;&#x4E09;&#x4E2A;&#x53EF;&#x80FD;&#x503C;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x5177;&#x4F53;&#x201C;&#x5927;&#x201D;&#x6BD4;&#x201C;&#x4E2D;&#x201D;&#x5927;&#x591A;&#x5C11;&#x662F;&#x672A;&#x77E5;&#x7684;&#x3002;</p>
<p>&#x5E8F;&#x6570;&#x5C5E;&#x6027;&#x53EF;&#x7528;&#x4E8E;&#x8BB0;&#x5F55;&#x4E0D;&#x80FD;&#x5BA2;&#x89C2;&#x5EA6;&#x91CF;&#x7684;&#x4E3B;&#x89C2;&#x8D28;&#x91CF;&#x8BC4;&#x4F30;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x5E8F;&#x6570;&#x5C5E;&#x6027;&#x5E38;&#x7528;&#x4E8E;&#x7B49;&#x7EA7;&#x8BC4;&#x5B9A;&#x8C03;&#x67E5;&#x3002;&#x5982;&#x67D0;&#x9500;&#x552E;&#x90E8;&#x95E8;&#x5BA2;&#x6237;&#x670D;&#x52A1;&#x8D28;&#x91CF;&#x7684;&#x8BC4;&#x4F30;&#xFF0C;0&#x8868;&#x793A;&#x5F88;&#x4E0D;&#x6EE1;&#x610F;&#xFF0C;1&#x4E0D;&#x592A;&#x6EE1;&#x610F;&#xFF0C;2&#x8868;&#x793A;&#x4E2D;&#x6027;&#xFF0C;3&#x8868;&#x793A;&#x6EE1;&#x610F;&#xFF0C;4&#x8868;&#x793A;&#x975E;&#x5E38;&#x6EE1;&#x610F;&#x3002;</p>
<p>&#x901A;&#x8FC7;&#x6570;&#x636E;&#x9884;&#x5904;&#x7406;&#x4E2D;&#x7684;&#x6570;&#x636E;&#x89C4;&#x7EA6;&#xFF0C;&#x5E8F;&#x6570;&#x5C5E;&#x6027;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x5C06;&#x6570;&#x636E;&#x7684;&#x503C;&#x57DF;&#x5212;&#x5206;&#x6210;&#x6709;&#x9650;&#x4E2A;&#x6709;&#x5E8F;&#x7C7B;&#x522B;&#xFF0C;&#x5C06;&#x6570;&#x503C;&#x5C5E;&#x6027;&#x79BB;&#x6563;&#x5316;&#x800C;&#x5F97;&#x5230;&#x3002;&#x5E94;&#x6CE8;&#x610F;&#x7684;&#x662F;&#xFF0C;&#x6807;&#x79F0;&#x3001;&#x4E8C;&#x5143;&#x548C;&#x5E8F;&#x6570;&#x5C5E;&#x6027;&#x90FD;&#x662F;&#x5B9A;&#x6027;&#x7684;&#xFF0C;&#x53EA;&#x63CF;&#x8FF0;&#x6837;&#x672C;&#x7684;&#x7279;&#x5F81;&#xFF0C;&#x800C;&#x4E0D;&#x7ED9;&#x51FA;&#x5B9E;&#x9645;&#x5927;&#x5C0F;&#x6216;&#x6570;&#x91CF;&#x3002;&#x4E0B;&#x9762;&#x4ECB;&#x7ECD;&#x63D0;&#x4F9B;&#x6837;&#x672C;&#x5B9A;&#x91CF;&#x5EA6;&#x91CF;&#x7684;&#x6570;&#x503C;&#x5C5E;&#x6027;&#x3002;</p>
<h3 id="d&#x3001;&#x6570;&#x503C;&#x5C5E;&#x6027;&#xFF08;numerical-attribute&#xFF09;">D&#x3001;&#x6570;&#x503C;&#x5C5E;&#x6027;&#xFF08;numerical attribute&#xFF09;</h3>
<p>&#x6570;&#x503C;&#x5C5E;&#x6027;&#x662F;&#x53EF;&#x5EA6;&#x91CF;&#x7684;&#x91CF;&#xFF0C;&#x7528;&#x6574;&#x6570;&#x6216;&#x5B9E;&#x6570;&#x503C;&#x8868;&#x793A;&#xFF0C;&#x6709;&#x533A;&#x95F4;&#x6807;&#x5EA6;&#x548C;&#x6BD4;&#x7387;&#x6807;&#x5EA6;&#x4E24;&#x79CD;&#x7C7B;&#x578B;&#x3002;</p>
<h4 id="a-&#x533A;&#x95F4;&#x6807;&#x5EA6;&#xFF08;interval-scaled&#xFF09;&#x5C5E;&#x6027;">a) &#x533A;&#x95F4;&#x6807;&#x5EA6;&#xFF08;interval-scaled&#xFF09;&#x5C5E;&#x6027;</h4>
<p>&#x533A;&#x95F4;&#x6807;&#x5EA6;&#x5C5E;&#x6027;&#x7528;&#x76F8;&#x7B49;&#x7684;&#x5355;&#x4F4D;&#x5C3A;&#x5EA6;&#x5EA6;&#x91CF;&#x3002;&#x533A;&#x95F4;&#x5C5E;&#x6027;&#x7684;&#x503C;&#x6709;&#x5E8F;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x9664;&#x4E86;&#x79E9;&#x8BC4;&#x5B9A;&#x4E4B;&#x5916;&#xFF0C;&#x8FD9;&#x79CD;&#x5C5E;&#x6027;&#x5141;&#x8BB8;&#x6BD4;&#x8F83;&#x548C;&#x5B9A;&#x91CF;&#x8BC4;&#x4F30;&#x503C;&#x4E4B;&#x95F4;&#x7684;&#x5DEE;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x8EAB;&#x9AD8;&#x5C5E;&#x6027;&#x662F;&#x533A;&#x95F4;&#x6807;&#x5EA6;&#x7684;&#x3002;&#x5047;&#x8BBE;&#x6211;&#x4EEC;&#x6709;&#x4E00;&#x4E2A;&#x73ED;&#x5B66;&#x751F;&#x7684;&#x8EAB;&#x9AD8;&#x7EDF;&#x8BA1;&#x503C;&#xFF0C;&#x5C06;&#x6BCF;&#x4E00;&#x4E2A;&#x4EBA;&#x89C6;&#x4E3A;&#x4E00;&#x4E2A;&#x6837;&#x672C;&#xFF0C;&#x5C06;&#x8FD9;&#x4E9B;&#x5B66;&#x751F;&#x8EAB;&#x9AD8;&#x503C;&#x6392;&#x5E8F;&#xFF0C;&#x53EF;&#x4EE5;&#x91CF;&#x5316;&#x4E0D;&#x540C;&#x503C;&#x4E4B;&#x95F4;&#x7684;&#x5DEE;&#x3002;A&#x540C;&#x5B66;&#x8EAB;&#x9AD8;170cm&#x6BD4;B&#x540C;&#x5B66;165cm&#x9AD8;&#x51FA;5cm&#x3002;</p>
<p>&#x5BF9;&#x4E8E;&#x6CA1;&#x6709;&#x771F;&#x6B63;&#x96F6;&#x70B9;&#x7684;&#x6444;&#x6C0F;&#x6E29;&#x5EA6;&#x548C;&#x534E;&#x6C0F;&#x6E29;&#x5EA6;&#xFF0C;&#x5176;&#x96F6;&#x503C;&#x4E0D;&#x8868;&#x793A;&#x6CA1;&#x6709;&#x6E29;&#x5EA6;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x6444;&#x6C0F;&#x6E29;&#x5EA6;&#x7684;&#x5EA6;&#x91CF;&#x5355;&#x4F4D;&#x662F;&#x6C34;&#x5728;&#x6807;&#x51C6;&#x5927;&#x6C14;&#x538B;&#x4E0B;&#x6CB8;&#x70B9;&#x6E29;&#x5EA6;&#x4E0E;&#x51B0;&#x70B9;&#x6E29;&#x5EA6;&#x4E4B;&#x5DEE;&#x7684;1/100&#x3002;&#x5C3D;&#x7BA1;&#x53EF;&#x4EE5;&#x8BA1;&#x7B97;&#x6E29;&#x5EA6;&#x4E4B;&#x5DEE;&#xFF0C;&#x4F46;&#x56E0;&#x6CA1;&#x6709;&#x771F;&#x6B63;&#x7684;&#x96F6;&#x503C;&#xFF0C;&#x56E0;&#x6B64;&#x4E0D;&#x80FD;&#x8BF4;10&#x2103;&#x6BD4;5&#x2103;&#x6E29;&#x6696;2&#x500D;&#xFF0C;&#x4E0D;&#x80FD;&#x7528;&#x6BD4;&#x7387;&#x63CF;&#x8FF0;&#x8FD9;&#x4E9B;&#x503C;&#x3002;&#x4F46;&#x6BD4;&#x7387;&#x6807;&#x5EA6;&#x5C5E;&#x6027;&#x5B58;&#x5728;&#x771F;&#x6B63;&#x7684;&#x96F6;&#x70B9;&#x3002;</p>
<h4 id="b-&#x6BD4;&#x7387;&#x6807;&#x5EA6;&#xFF08;ratio-scaled&#xFF09;&#x5C5E;&#x6027;">b) &#x6BD4;&#x7387;&#x6807;&#x5EA6;&#xFF08;ratio-scaled&#xFF09;&#x5C5E;&#x6027;</h4>
<p>&#x6BD4;&#x7387;&#x6807;&#x5EA6;&#x5C5E;&#x6027;&#x7684;&#x5EA6;&#x91CF;&#x662F;&#x6BD4;&#x7387;&#x7684;&#xFF0C;&#x53EF;&#x4EE5;&#x7528;&#x6BD4;&#x7387;&#x6765;&#x63CF;&#x8FF0;&#x4E24;&#x4E2A;&#x503C;&#xFF0C;&#x5373;&#x4E00;&#x4E2A;&#x503C;&#x662F;&#x53E6;&#x4E00;&#x4E2A;&#x503C;&#x7684;&#x500D;&#x6570;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x8BA1;&#x7B97;&#x503C;&#x4E4B;&#x95F4;&#x7684;&#x5DEE;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x4E0D;&#x540C;&#x4E8E;&#x6444;&#x6C0F;&#x548C;&#x534E;&#x6C0F;&#x6E29;&#x5EA6;&#xFF0C;&#x5F00;&#x6C0F;&#x6E29;&#x5EA6;&#x5177;&#x6709;&#x7EDD;&#x5BF9;&#x96F6;&#x70B9;&#x3002;&#x5728;&#x96F6;&#x70B9;&#xFF0C;&#x6784;&#x6210;&#x7269;&#x8D28;&#x7684;&#x7C92;&#x5B50;&#x5177;&#x6709;&#x96F6;&#x52A8;&#x80FD;&#x3002;&#x6BD4;&#x7387;&#x6807;&#x5EA6;&#x5C5E;&#x6027;&#x7684;&#x4F8B;&#x5B50;&#x8FD8;&#x5305;&#x62EC;&#x5B57;&#x6570;&#x548C;&#x5DE5;&#x9F84;&#x7B49;&#x8BA1;&#x6570;&#x5C5E;&#x6027;&#xFF0C;&#x4EE5;&#x53CA;&#x5EA6;&#x91CF;&#x91CD;&#x91CF;&#x3001;&#x9AD8;&#x5EA6;&#x3001;&#x901F;&#x5EA6;&#x7684;&#x5C5E;&#x6027;&#x3002;</p>
<h2 id="e&#x3001;&#x79BB;&#x6563;&#x5C5E;&#x6027;&#x4E0E;&#x8FDE;&#x7EED;&#x5C5E;&#x6027;">E&#x3001;&#x79BB;&#x6563;&#x5C5E;&#x6027;&#x4E0E;&#x8FDE;&#x7EED;&#x5C5E;&#x6027;</h2>
<p>&#x524D;&#x9762;&#x4ECB;&#x7ECD;&#x7684;&#x56DB;&#x79CD;&#x5C5E;&#x6027;&#x7C7B;&#x578B;&#x4E4B;&#x95F4;&#x4E0D;&#x662F;&#x4E92;&#x65A5;&#x7684;&#x3002;&#x6211;&#x4EEC;&#x8FD8;&#x53EF;&#x4EE5;&#x7528;&#x8BB8;&#x591A;&#x5176;&#x4ED6;&#x65B9;&#x6CD5;&#x6765;&#x7EC4;&#x7EC7;&#x5C5E;&#x6027;&#x7C7B;&#x578B;&#xFF0C;&#x4F7F;&#x7C7B;&#x578B;&#x95F4;&#x4E0D;&#x4E92;&#x65A5;&#x3002;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x9886;&#x57DF;&#x7684;&#x5206;&#x7C7B;&#x7B97;&#x6CD5;&#x5E38;&#x628A;&#x5C5E;&#x6027;&#x5206;&#x4E3A;&#x79BB;&#x6563;&#x7684;&#x6216;&#x8FDE;&#x7EED;&#x7684;&#x5C5E;&#x6027;&#x3002;&#x4E0D;&#x540C;&#x7C7B;&#x578B;&#x6709;&#x4E0D;&#x540C;&#x7684;&#x5904;&#x7406;&#x65B9;&#x6CD5;&#x3002;</p>
<p>&#x79BB;&#x6563;&#x5C5E;&#x6027;&#x5177;&#x6709;&#x6709;&#x9650;&#x6216;&#x65E0;&#x9650;&#x53EF;&#x6570;&#x4E2A;&#x503C;&#x3002;&#x5982;&#x5B66;&#x751F;&#x6210;&#x7EE9;&#x5C5E;&#x6027;&#xFF0C;&#x4F18;&#x3001;&#x826F;&#x3001;&#x4E2D;&#x3001;&#x5DEE;&#xFF1B;&#x4E8C;&#x5143;&#x5C5E;&#x6027;&#x53D6;1&#x548C;0&#x4EE5;&#x53CA;&#x5E74;&#x9F84;&#x5C5E;&#x6027;&#x53D6;0&#x5230;110&#x3002;&#x5982;&#x4E00;&#x4E2A;&#x5C5E;&#x6027;&#x53EF;&#x80FD;&#x53D6;&#x503C;&#x7684;&#x503C;&#x96C6;&#x5408;&#x662F;&#x65E0;&#x9650;&#x7684;&#xFF0C;&#x4F46;&#x53EF;&#x4EE5;&#x5EFA;&#x7ACB;&#x4E00;&#x4E2A;&#x4E0E;&#x81EA;&#x7136;&#x6570;&#x7684;&#x4E00;&#x4E00;&#x5BF9;&#x5E94;&#xFF0C;&#x5219;&#x5176;&#x4E5F;&#x662F;&#x79BB;&#x6563;&#x5C5E;&#x6027;&#x3002;&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x5C5E;&#x6027;&#x4E0D;&#x662F;&#x79BB;&#x6563;&#x7684;&#xFF0C;&#x5219;&#x5B83;&#x662F;&#x8FDE;&#x7EED;&#x7684;&#x3002;&#x6CE8;&#x610F;&#xFF1A;&#x5728;&#x6587;&#x732E;&#x4E2D;&#xFF0C;&#x672F;&#x8BED; &#x201C;&#x6570;&#x503C;&#x5C5E;&#x6027;&#x201D; &#x548C;&#x201C;&#x8FDE;&#x7EED;&#x5C5E;&#x6027;&#x201D;&#x5E38;&#x53EF;&#x4EE5;&#x4E92;&#x6362;&#x4F7F;&#x7528;&#xFF0C;&#x56E0;&#x6B64;&#xFF0C;&#x201C;&#x8FDE;&#x7EED;&#x5C5E;&#x6027;&#x201D;&#x4E5F;&#x5E38;&#x88AB;&#x79F0;&#x4E3A;&#x201C;&#x6570;&#x503C;&#x5C5E;&#x6027;&#x201D;&#x3002;</p>
<p>&#x53C2;&#x8003;&#x4E66;&#x76EE;&#x300A;&#x65E0;&#x76D1;&#x7763;&#x5B66;&#x4E60;&#x65B9;&#x6CD5;&#x53CA;&#x5176;&#x5E94;&#x7528;&#x300B;</p>
<footer class="page-footer-ex"> <span class="page-footer-ex-copyright"> <a href="https://github.com/geekcircle" target="_blank">geekcircle</a> </span> &#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; <span class="page-footer-ex-footer-update"> <strong>updated</strong> 2018-05-16 22:46:13 </span> </footer>
                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="4.html" class="navigation navigation-prev " aria-label="Previous page: 4. 余弦相似与欧氏距离有什么区别和联系">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="6.html" class="navigation navigation-next " aria-label="Next page: 6. 监督学习和无监督学习">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"5. 下面哪个不属于数据的属性类型","level":"1.2.5","depth":2,"next":{"title":"6. 监督学习和无监督学习","level":"1.2.6","depth":2,"path":"questions/6.md","ref":"questions/6.md","articles":[]},"previous":{"title":"4. 余弦相似与欧氏距离有什么区别和联系","level":"1.2.4","depth":2,"path":"questions/4.md","ref":"questions/4.md","articles":[]},"dir":"ltr"},"config":{"plugins":["-highlight","expandable-chapters","splitter","page-footer-ex","prism","github","github-buttons","sitemap-general"],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"prism":{},"github":{"url":"https://github.com/geekcircle/machine-learning-interview-qa"},"page-footer-ex":{"copyright":"[geekcircle](https://github.com/geekcircle)","markdown":true,"update_format":"YYYY-MM-DD HH:mm:ss","update_label":"<strong>updated</strong>"},"splitter":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sitemap-general":{"prefix":"https://geekcircle.github.io/machine-learning-interview-qa/"},"fontsettings":{"theme":"white","family":"sans","size":2},"github-buttons":{"buttons":[{"user":"geekcircle","repo":"machine-learning-interview-qa","type":"star","size":"large"}]},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false},"expandable-chapters":{}},"theme":"default","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"机器学习面试笔试题 - 极客圈","language":"zh-hans","links":{"sidebar":{"极客兔兔的博客":"https://geektutu.com/series","machine-learning-interview-qa":"https://github.com/geekcircle/machine-learning-interview-qa"}},"gitbook":"*","description":"持续整理机器学习面试笔试题"},"file":{"path":"questions/5.md","mtime":"2018-05-16T14:46:13.232Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2018-05-30T16:26:22.278Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-expandable-chapters/expandable-chapters.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-splitter/splitter.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-github/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-github-buttons/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

