
<!DOCTYPE HTML>
<html lang="zh-hans" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>6. 监督学习和无监督学习 · 机器学习面试笔试题 - 极客圈</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-expandable-chapters/expandable-chapters.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-splitter/splitter.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-page-footer-ex/style/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-prism/prism.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="7.html" />
    
    
    <link rel="prev" href="5.html" />
    

    <style>
    @media only screen and (max-width: 640px) {
        .book-header .hidden-mobile {
            display: none;
        }
    }
    </style>
    <script>
        window["gitbook-plugin-github-buttons"] = {"buttons":[{"user":"geekcircle","repo":"machine-learning-interview-qa","type":"star","size":"large"}]};
    </script>

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="输入并搜索" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    
    
        
        <li>
            <a href="https://geektutu.com/series" target="_blank" class="custom-link">极客兔兔的博客</a>
        </li>
    
        
        <li>
            <a href="https://github.com/geekcircle/machine-learning-interview-qa" target="_blank" class="custom-link">machine-learning-interview-qa</a>
        </li>
    
    

    
    <li class="divider"></li>
    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    序言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" >
            
                <span>
            
                    
                    题目
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.2.1" data-path="1.html">
            
                <a href="1.html">
            
                    
                    1. 如何处理特征向量的缺失值
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.2" data-path="2.html">
            
                <a href="2.html">
            
                    
                    2. 请简要说说一个完整机器学习项目的流程
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.3" data-path="3.html">
            
                <a href="3.html">
            
                    
                    3. 某超市研究销售记录发现买啤酒的人很大概率也会买尿布，这属于数据挖掘的哪类问题
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.4" data-path="4.html">
            
                <a href="4.html">
            
                    
                    4. 余弦相似与欧氏距离有什么区别和联系
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.5" data-path="5.html">
            
                <a href="5.html">
            
                    
                    5. 下面哪个不属于数据的属性类型
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.2.6" data-path="6.html">
            
                <a href="6.html">
            
                    
                    6. 监督学习和无监督学习
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.7" data-path="7.html">
            
                <a href="7.html">
            
                    
                    7. 熵是为消除不确定性所需要获得的信息量，投掷均匀正六面体骰子的熵是
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.8" data-path="8.html">
            
                <a href="8.html">
            
                    
                    8. 数据清洗与特征处理
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.9" data-path="9.html">
            
                <a href="9.html">
            
                    
                    9. 猜测这种划分最可能是什么聚类算法的结果
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            本书使用 GitBook 发布
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >6. 监督学习和无监督学习</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="6-&#x76D1;&#x7763;&#x5B66;&#x4E60;&#x548C;&#x65E0;&#x76D1;&#x7763;&#x5B66;&#x4E60;">6. &#x76D1;&#x7763;&#x5B66;&#x4E60;&#x548C;&#x65E0;&#x76D1;&#x7763;&#x5B66;&#x4E60;</h1>
<h2 id="&#x5173;&#x952E;&#x533A;&#x522B;">&#x5173;&#x952E;&#x533A;&#x522B;</h2>
<p><strong>&#x662F;&#x5426;&#x6709;&#x76D1;&#x7763;&#xFF08;supervised&#xFF09;&#xFF0C;&#x5C31;&#x770B;&#x8F93;&#x5165;&#x6570;&#x636E;&#x662F;&#x5426;&#x6709;&#x6807;&#x7B7E;&#xFF08;label&#xFF09;&#x3002;&#x8F93;&#x5165;&#x6570;&#x636E;&#x6709;&#x6807;&#x7B7E;&#xFF0C;&#x5219;&#x4E3A;&#xFF08;&#x6709;&#xFF09;&#x76D1;&#x7763;&#x5B66;&#x4E60;&#xFF0C;&#x6CA1;&#x6807;&#x7B7E;&#x5219;&#x4E3A;&#x65E0;&#x76D1;&#x7763;&#x5B66;&#x4E60;&#x3002;</strong></p>
<h3 id="&#x77E5;&#x4E4E;&#x7684;&#x901A;&#x4FD7;&#x56DE;&#x7B54;">&#x77E5;&#x4E4E;&#x7684;&#x901A;&#x4FD7;&#x56DE;&#x7B54;</h3>
<p>&#x4F5C;&#x8005;&#xFF1A;&#x738B;&#x4E30;
<a href="https://www.zhihu.com/question/23194489/answer/25028661" target="_blank">&#x94FE;&#x63A5;</a></p>
<p>&#x9996;&#x5148;&#x770B;&#x4EC0;&#x4E48;&#x662F;&#x5B66;&#x4E60;&#xFF08;learning&#xFF09;&#xFF1F;&#x4E00;&#x4E2A;&#x6210;&#x8BED;&#x5C31;&#x53EF;&#x6982;&#x62EC;&#xFF1A;&#x4E3E;&#x4E00;&#x53CD;&#x4E09;&#x3002;&#x6B64;&#x5904;&#x4EE5;&#x9AD8;&#x8003;&#x4E3A;&#x4F8B;&#xFF0C;&#x9AD8;&#x8003;&#x7684;&#x9898;&#x76EE;&#x5728;&#x4E0A;&#x8003;&#x573A;&#x524D;&#x6211;&#x4EEC;&#x672A;&#x5FC5;&#x505A;&#x8FC7;&#xFF0C;&#x4F46;&#x5728;&#x9AD8;&#x4E2D;&#x4E09;&#x5E74;&#x6211;&#x4EEC;&#x505A;&#x8FC7;&#x5F88;&#x591A;&#x5F88;&#x591A;&#x9898;&#x76EE;&#xFF0C;&#x61C2;&#x89E3;&#x9898;&#x65B9;&#x6CD5;&#xFF0C;&#x56E0;&#x6B64;&#x8003;&#x573A;&#x4E0A;&#x9762;&#x5BF9;&#x964C;&#x751F;&#x95EE;&#x9898;&#x4E5F;&#x53EF;&#x4EE5;&#x7B97;&#x51FA;&#x7B54;&#x6848;&#x3002;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x7684;&#x601D;&#x8DEF;&#x4E5F;&#x7C7B;&#x4F3C;&#xFF1A;&#x6211;&#x4EEC;&#x80FD;&#x4E0D;&#x80FD;&#x5229;&#x7528;&#x4E00;&#x4E9B;&#x8BAD;&#x7EC3;&#x6570;&#x636E;&#xFF08;&#x5DF2;&#x7ECF;&#x505A;&#x8FC7;&#x7684;&#x9898;&#xFF09;&#xFF0C;&#x4F7F;&#x673A;&#x5668;&#x80FD;&#x591F;&#x5229;&#x7528;&#x5B83;&#x4EEC;&#xFF08;&#x89E3;&#x9898;&#x65B9;&#x6CD5;&#xFF09;&#x5206;&#x6790;&#x672A;&#x77E5;&#x6570;&#x636E;&#xFF08;&#x9AD8;&#x8003;&#x7684;&#x9898;&#x76EE;&#xFF09;&#xFF1F;</p>
<p>&#x6700;&#x7B80;&#x5355;&#x4E5F;&#x6700;&#x666E;&#x904D;&#x7684;&#x4E00;&#x7C7B;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x7B97;&#x6CD5;&#x5C31;&#x662F;&#x5206;&#x7C7B;&#xFF08;classification&#xFF09;&#x3002;&#x5BF9;&#x4E8E;&#x5206;&#x7C7B;&#xFF0C;&#x8F93;&#x5165;&#x7684;&#x8BAD;&#x7EC3;&#x6570;&#x636E;&#x6709;&#x7279;&#x5F81;&#xFF08;feature&#xFF09;&#xFF0C;&#x6709;&#x6807;&#x7B7E;&#xFF08;label&#xFF09;&#x3002;&#x6240;&#x8C13;&#x7684;&#x5B66;&#x4E60;&#xFF0C;&#x5176;&#x672C;&#x8D28;&#x5C31;&#x662F;&#x627E;&#x5230;&#x7279;&#x5F81;&#x548C;&#x6807;&#x7B7E;&#x95F4;&#x7684;&#x5173;&#x7CFB;&#xFF08;mapping&#xFF09;&#x3002;&#x8FD9;&#x6837;&#x5F53;&#x6709;&#x7279;&#x5F81;&#x800C;&#x65E0;&#x6807;&#x7B7E;&#x7684;&#x672A;&#x77E5;&#x6570;&#x636E;&#x8F93;&#x5165;&#x65F6;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x5DF2;&#x6709;&#x7684;&#x5173;&#x7CFB;&#x5F97;&#x5230;&#x672A;&#x77E5;&#x6570;&#x636E;&#x6807;&#x7B7E;&#x3002;</p>
<p>&#x5728;&#x4E0A;&#x8FF0;&#x7684;&#x5206;&#x7C7B;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x5982;&#x679C;&#x6240;&#x6709;&#x8BAD;&#x7EC3;&#x6570;&#x636E;&#x90FD;&#x6709;&#x6807;&#x7B7E;&#xFF0C;&#x5219;&#x4E3A;&#x6709;&#x76D1;&#x7763;&#x5B66;&#x4E60;&#xFF08;supervised learning&#xFF09;&#x3002;&#x5982;&#x679C;&#x6570;&#x636E;&#x6CA1;&#x6709;&#x6807;&#x7B7E;&#xFF0C;&#x663E;&#x7136;&#x5C31;&#x662F;&#x65E0;&#x76D1;&#x7763;&#x5B66;&#x4E60;&#xFF08;unsupervised learning&#xFF09;&#x4E86;&#xFF0C;&#x4E5F;&#x5373;&#x805A;&#x7C7B;&#xFF08;clustering&#xFF09;&#x3002;&#x76EE;&#x524D;&#x5206;&#x7C7B;&#x7B97;&#x6CD5;&#x7684;&#x6548;&#x679C;&#x8FD8;&#x662F;&#x4E0D;&#x9519;&#x7684;&#xFF0C;&#x4F46;&#x76F8;&#x5BF9;&#x6765;&#x8BB2;&#xFF0C;&#x805A;&#x7C7B;&#x7B97;&#x6CD5;&#x5C31;&#x6709;&#x4E9B;&#x60E8;&#x4E0D;&#x5FCD;&#x7779;&#x4E86;&#x3002;&#x786E;&#x5B9E;&#xFF0C;&#x65E0;&#x76D1;&#x7763;&#x5B66;&#x4E60;&#x672C;&#x8EAB;&#x7684;&#x7279;&#x70B9;&#x4F7F;&#x5176;&#x96BE;&#x4EE5;&#x5F97;&#x5230;&#x5982;&#x5206;&#x7C7B;&#x4E00;&#x6837;&#x8FD1;&#x4E4E;&#x5B8C;&#x7F8E;&#x7684;&#x7ED3;&#x679C;&#x3002;&#x8FD9;&#x4E5F;&#x6B63;&#x5982;&#x6211;&#x4EEC;&#x5728;&#x9AD8;&#x4E2D;&#x505A;&#x9898;&#xFF0C;&#x7B54;&#x6848;&#xFF08;&#x6807;&#x7B7E;&#xFF09;&#x662F;&#x975E;&#x5E38;&#x91CD;&#x8981;&#x7684;&#xFF0C;&#x5047;&#x8BBE;&#x4E24;&#x4E2A;&#x5B8C;&#x5168;&#x76F8;&#x540C;&#x7684;&#x4EBA;&#x8FDB;&#x5165;&#x9AD8;&#x4E2D;&#xFF0C;&#x4E00;&#x4E2A;&#x6B63;&#x5E38;&#x5B66;&#x4E60;&#xFF0C;&#x53E6;&#x4E00;&#x4EBA;&#x505A;&#x7684;&#x6240;&#x6709;&#x9898;&#x76EE;&#x90FD;&#x6CA1;&#x6709;&#x7B54;&#x6848;&#xFF0C;&#x90A3;&#x4E48;&#x60F3;&#x5FC5;&#x7B2C;&#x4E00;&#x4E2A;&#x4EBA;&#x9AD8;&#x8003;&#x4F1A;&#x53D1;&#x6325;&#x66F4;&#x597D;&#xFF0C;&#x7B2C;&#x4E8C;&#x4E2A;&#x4EBA;&#x4F1A;&#x53D1;&#x75AF;&#x3002;</p>
<p>&#x8FD9;&#x65F6;&#x5404;&#x4F4D;&#x53EF;&#x80FD;&#x8981;&#x95EE;&#xFF0C;&#x65E2;&#x7136;&#x5206;&#x7C7B;&#x5982;&#x6B64;&#x4E4B;&#x597D;&#xFF0C;&#x805A;&#x7C7B;&#x5982;&#x6B64;&#x4E4B;&#x4E0D;&#x9760;&#x8C31;&#xFF0C;&#x90A3;&#x4E3A;&#x4F55;&#x6211;&#x4EEC;&#x8FD8;&#x53EF;&#x4EE5;&#x5BB9;&#x5FCD;&#x805A;&#x7C7B;&#x7684;&#x5B58;&#x5728;&#xFF1F;&#x56E0;&#x4E3A;&#x5728;&#x5B9E;&#x9645;&#x5E94;&#x7528;&#x4E2D;&#xFF0C;&#x6807;&#x7B7E;&#x7684;&#x83B7;&#x53D6;&#x5E38;&#x5E38;&#x9700;&#x8981;&#x6781;&#x5927;&#x7684;&#x4EBA;&#x5DE5;&#x5DE5;&#x4F5C;&#x91CF;&#xFF0C;&#x6709;&#x65F6;&#x751A;&#x81F3;&#x975E;&#x5E38;&#x56F0;&#x96BE;&#x3002;&#x4F8B;&#x5982;&#x5728;&#x81EA;&#x7136;&#x8BED;&#x8A00;&#x5904;&#x7406;&#xFF08;NLP&#xFF09;&#x4E2D;&#xFF0C;Penn Chinese Treebank&#x5728;2&#x5E74;&#x91CC;&#x53EA;&#x5B8C;&#x6210;&#x4E86;4000&#x53E5;&#x8BDD;&#x7684;&#x6807;&#x7B7E;&#x2026;&#x2026;</p>
<p><img src="image/6.nlp.jpg" alt="NLP&#x4E3E;&#x4F8B;"></p>
<p>&#x8FD9;&#x65F6;&#x6709;&#x4EBA;&#x53EF;&#x80FD;&#x4F1A;&#x60F3;&#xFF0C;&#x96BE;&#x9053;&#x6709;&#x76D1;&#x7763;&#x5B66;&#x4E60;&#x548C;&#x65E0;&#x76D1;&#x7763;&#x5B66;&#x4E60;&#x5C31;&#x662F;&#x975E;&#x9ED1;&#x5373;&#x767D;&#x7684;&#x5173;&#x7CFB;&#x5417;&#xFF1F;&#x6709;&#x6CA1;&#x6709;&#x7070;&#x5462;&#xFF1F;Good idea&#x3002;&#x7070;&#x662F;&#x5B58;&#x5728;&#x7684;&#x3002;&#x4E8C;&#x8005;&#x7684;&#x4E2D;&#x95F4;&#x5E26;&#x5C31;&#x662F;&#x534A;&#x76D1;&#x7763;&#x5B66;&#x4E60;&#xFF08;semi-supervised learning&#xFF09;&#x3002;&#x5BF9;&#x4E8E;&#x534A;&#x76D1;&#x7763;&#x5B66;&#x4E60;&#xFF0C;&#x5176;&#x8BAD;&#x7EC3;&#x6570;&#x636E;&#x7684;&#x4E00;&#x90E8;&#x5206;&#x662F;&#x6709;&#x6807;&#x7B7E;&#x7684;&#xFF0C;&#x53E6;&#x4E00;&#x90E8;&#x5206;&#x6CA1;&#x6709;&#x6807;&#x7B7E;&#xFF0C;&#x800C;&#x6CA1;&#x6807;&#x7B7E;&#x6570;&#x636E;&#x7684;&#x6570;&#x91CF;&#x5E38;&#x5E38;&#x6781;&#x5927;&#x4E8E;&#x6709;&#x6807;&#x7B7E;&#x6570;&#x636E;&#x6570;&#x91CF;&#xFF08;&#x8FD9;&#x4E5F;&#x662F;&#x7B26;&#x5408;&#x73B0;&#x5B9E;&#x60C5;&#x51B5;&#x7684;&#xFF09;&#x3002;&#x9690;&#x85CF;&#x5728;&#x534A;&#x76D1;&#x7763;&#x5B66;&#x4E60;&#x4E0B;&#x7684;&#x57FA;&#x672C;&#x89C4;&#x5F8B;&#x5728;&#x4E8E;&#xFF1A;&#x6570;&#x636E;&#x7684;&#x5206;&#x5E03;&#x5FC5;&#x7136;&#x4E0D;&#x662F;&#x5B8C;&#x5168;&#x968F;&#x673A;&#x7684;&#xFF0C;&#x901A;&#x8FC7;&#x4E00;&#x4E9B;&#x6709;&#x6807;&#x7B7E;&#x6570;&#x636E;&#x7684;&#x5C40;&#x90E8;&#x7279;&#x5F81;&#xFF0C;&#x4EE5;&#x53CA;&#x66F4;&#x591A;&#x6CA1;&#x6807;&#x7B7E;&#x6570;&#x636E;&#x7684;&#x6574;&#x4F53;&#x5206;&#x5E03;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x5F97;&#x5230;&#x53EF;&#x4EE5;&#x63A5;&#x53D7;&#x751A;&#x81F3;&#x662F;&#x975E;&#x5E38;&#x597D;&#x7684;&#x5206;&#x7C7B;&#x7ED3;&#x679C;&#x3002;&#xFF08;&#x6B64;&#x5904;&#x5927;&#x91CF;&#x5FFD;&#x7565;&#x7EC6;&#x8282;&#xFF09;</p>
<p>&#x56E0;&#x6B64;&#xFF0C;learning&#x5BB6;&#x65CF;&#x7684;&#x6574;&#x4F53;&#x6784;&#x9020;&#x662F;&#x8FD9;&#x6837;&#x7684;&#xFF1A;</p>
<ul>
<li>&#x6709;&#x76D1;&#x7763;&#x5B66;&#x4E60;&#xFF08;&#x5206;&#x7C7B;&#xFF0C;&#x56DE;&#x5F52;&#xFF09;</li>
<li>&#x2195;</li>
<li>&#x534A;&#x76D1;&#x7763;&#x5B66;&#x4E60;&#xFF08;&#x5206;&#x7C7B;&#xFF0C;&#x56DE;&#x5F52;&#xFF09;&#xFF0C;transductive learning&#xFF08;&#x5206;&#x7C7B;&#xFF0C;&#x56DE;&#x5F52;&#xFF09;</li>
<li>&#x2195;</li>
<li>&#x534A;&#x76D1;&#x7763;&#x805A;&#x7C7B;&#xFF08;&#x6709;&#x6807;&#x7B7E;&#x6570;&#x636E;&#x7684;&#x6807;&#x7B7E;&#x4E0D;&#x662F;&#x786E;&#x5B9A;&#x7684;&#xFF0C;&#x7C7B;&#x4F3C;&#x4E8E;&#xFF1A;&#x80AF;&#x5B9A;&#x4E0D;&#x662F;xxx&#xFF0C;&#x5F88;&#x53EF;&#x80FD;&#x662F;yyy&#xFF09;</li>
<li>&#x2195;</li>
<li>&#x65E0;&#x76D1;&#x7763;&#x5B66;&#x4E60;&#xFF08;&#x805A;&#x7C7B;&#xFF09;</li>
</ul>
<h2 id="&#x6982;&#x5FF5;">&#x6982;&#x5FF5;</h2>
<h3 id="&#x76D1;&#x7763;&#x5B66;&#x4E60;">&#x76D1;&#x7763;&#x5B66;&#x4E60;</h3>
<p>&#x901A;&#x8FC7;&#x5DF2;&#x6709;&#x7684;&#x8BAD;&#x7EC3;&#x6837;&#x672C;&#xFF08;&#x5373;&#x5DF2;&#x77E5;&#x6570;&#x636E;&#x4EE5;&#x53CA;&#x5176;&#x5BF9;&#x5E94;&#x7684;&#x8F93;&#x51FA;&#xFF09;&#x6765;&#x8BAD;&#x7EC3;&#xFF0C;&#x4ECE;&#x800C;&#x5F97;&#x5230;&#x4E00;&#x4E2A;&#x6700;&#x4F18;&#x6A21;&#x578B;&#xFF0C;&#x518D;&#x5229;&#x7528;&#x8FD9;&#x4E2A;&#x6A21;&#x578B;&#x5C06;&#x6240;&#x6709;&#x65B0;&#x7684;&#x6570;&#x636E;&#x6837;&#x672C;&#x6620;&#x5C04;&#x4E3A;&#x76F8;&#x5E94;&#x7684;&#x8F93;&#x51FA;&#x7ED3;&#x679C;&#xFF0C;&#x5BF9;&#x8F93;&#x51FA;&#x7ED3;&#x679C;&#x8FDB;&#x884C;&#x7B80;&#x5355;&#x7684;&#x5224;&#x65AD;&#x4ECE;&#x800C;&#x5B9E;&#x73B0;&#x5206;&#x7C7B;&#x7684;&#x76EE;&#x7684;&#xFF0C;&#x90A3;&#x4E48;&#x8FD9;&#x4E2A;&#x6700;&#x4F18;&#x6A21;&#x578B;&#x4E5F;&#x5C31;&#x5177;&#x6709;&#x4E86;&#x5BF9;&#x672A;&#x77E5;&#x6570;&#x636E;&#x8FDB;&#x884C;&#x5206;&#x7C7B;&#x7684;&#x80FD;&#x529B;&#x3002;</p>
<p>&#x76D1;&#x7763;&#x5B66;&#x4E60;&#x6700;&#x5E38;&#x89C1;&#x7684;&#x5C31;&#x662F;&#xFF1A;&#x5206;&#x7C7B;&#xFF08;classification&#xFF09;&amp;&#x56DE;&#x5F52;&#xFF08;regression&#xFF09;</p>
<h3 id="&#x65E0;&#x76D1;&#x7763;&#x5B66;&#x4E60;">&#x65E0;&#x76D1;&#x7763;&#x5B66;&#x4E60;</h3>
<p>&#x8F93;&#x5165;&#x6570;&#x636E;&#x6CA1;&#x6709;&#x88AB;&#x6807;&#x8BB0;&#xFF0C;&#x4E5F;&#x6CA1;&#x6709;&#x786E;&#x5B9A;&#x7684;&#x7ED3;&#x679C;&#x3002;&#x6837;&#x672C;&#x6570;&#x636E;&#x7C7B;&#x522B;&#x672A;&#x77E5;&#xFF0C;&#x9700;&#x8981;&#x6839;&#x636E;&#x6837;&#x672C;&#x95F4;&#x7684;&#x76F8;&#x4F3C;&#x6027;&#x5BF9;&#x6837;&#x672C;&#x96C6;&#x8FDB;&#x884C;&#x5206;&#x7C7B;&#xFF08;&#x805A;&#x7C7B;&#xFF0C;clustering&#xFF09;&#x8BD5;&#x56FE;&#x4F7F;&#x7C7B;&#x5185;&#x5DEE;&#x8DDD;&#x6700;&#x5C0F;&#x5316;&#xFF0C;&#x7C7B;&#x95F4;&#x5DEE;&#x8DDD;&#x6700;&#x5927;&#x5316;&#x3002;&#x901A;&#x4FD7;&#x70B9;&#x5C06;&#x5C31;&#x662F;&#x5B9E;&#x9645;&#x5E94;&#x7528;&#x4E2D;&#xFF0C;&#x4E0D;&#x5C11;&#x60C5;&#x51B5;&#x4E0B;&#x65E0;&#x6CD5;&#x9884;&#x5148;&#x77E5;&#x9053;&#x6837;&#x672C;&#x7684;&#x6807;&#x7B7E;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#x6CA1;&#x6709;&#x8BAD;&#x7EC3;&#x6837;&#x672C;&#x5BF9;&#x5E94;&#x7684;&#x7C7B;&#x522B;&#xFF0C;&#x56E0;&#x800C;&#x53EA;&#x80FD;&#x4ECE;&#x539F;&#x5148;&#x6CA1;&#x6709;&#x6837;&#x672C;&#x6807;&#x7B7E;&#x7684;&#x6837;&#x672C;&#x96C6;&#x5F00;&#x59CB;&#x5B66;&#x4E60;&#x5206;&#x7C7B;&#x5668;&#x8BBE;&#x8BA1;&#x3002;</p>
<p>&#x65E0;&#x76D1;&#x7763;&#x5B66;&#x4E60;&#x6700;&#x5E38;&#x89C1;&#x7684;&#x5C31;&#x662F;&#xFF1A;&#x805A;&#x7C7B;&#xFF08;Clustering&#xFF09;</p>
<p>&#x65E0;&#x76D1;&#x7763;&#x5B66;&#x4E60;&#x4E3E;&#x4F8B;&#xFF1A;</p>
<ul>
<li>&#x65B0;&#x95FB;&#x5206;&#x7C7B;</li>
</ul>
<footer class="page-footer-ex"> <span class="page-footer-ex-copyright"> <a href="https://github.com/geekcircle" target="_blank">geekcircle</a> </span> &#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; <span class="page-footer-ex-footer-update"> <strong>updated</strong> 2018-05-24 01:25:02 </span> </footer>
                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="5.html" class="navigation navigation-prev " aria-label="Previous page: 5. 下面哪个不属于数据的属性类型">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="7.html" class="navigation navigation-next " aria-label="Next page: 7. 熵是为消除不确定性所需要获得的信息量，投掷均匀正六面体骰子的熵是">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"6. 监督学习和无监督学习","level":"1.2.6","depth":2,"next":{"title":"7. 熵是为消除不确定性所需要获得的信息量，投掷均匀正六面体骰子的熵是","level":"1.2.7","depth":2,"path":"questions/7.md","ref":"questions/7.md","articles":[]},"previous":{"title":"5. 下面哪个不属于数据的属性类型","level":"1.2.5","depth":2,"path":"questions/5.md","ref":"questions/5.md","articles":[]},"dir":"ltr"},"config":{"plugins":["-highlight","expandable-chapters","splitter","page-footer-ex","prism","github","github-buttons","sitemap-general"],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"prism":{},"github":{"url":"https://github.com/geekcircle/machine-learning-interview-qa"},"page-footer-ex":{"copyright":"[geekcircle](https://github.com/geekcircle)","markdown":true,"update_format":"YYYY-MM-DD HH:mm:ss","update_label":"<strong>updated</strong>"},"splitter":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sitemap-general":{"prefix":"https://geekcircle.github.io/machine-learning-interview-qa/"},"fontsettings":{"theme":"white","family":"sans","size":2},"github-buttons":{"buttons":[{"user":"geekcircle","repo":"machine-learning-interview-qa","type":"star","size":"large"}]},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false},"expandable-chapters":{}},"theme":"default","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"机器学习面试笔试题 - 极客圈","language":"zh-hans","links":{"sidebar":{"极客兔兔的博客":"https://geektutu.com/series","machine-learning-interview-qa":"https://github.com/geekcircle/machine-learning-interview-qa"}},"gitbook":"*","description":"持续整理机器学习面试笔试题"},"file":{"path":"questions/6.md","mtime":"2018-05-23T17:25:02.000Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2018-05-25T13:32:15.920Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-expandable-chapters/expandable-chapters.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-splitter/splitter.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-github/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-github-buttons/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

