
<!DOCTYPE HTML>
<html lang="zh-hans" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>8. 数据清洗与特征处理 · 机器学习面试笔试题 - 极客圈</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-expandable-chapters/expandable-chapters.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-splitter/splitter.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-page-footer-ex/style/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-prism/prism.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="9.html" />
    
    
    <link rel="prev" href="7.html" />
    

    <style>
    @media only screen and (max-width: 640px) {
        .book-header .hidden-mobile {
            display: none;
        }
    }
    </style>
    <script>
        window["gitbook-plugin-github-buttons"] = {"buttons":[{"user":"geekcircle","repo":"machine-learning-interview-qa","type":"star","size":"large"}]};
    </script>

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="输入并搜索" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    
    
        
        <li>
            <a href="https://geektutu.com/series" target="_blank" class="custom-link">极客兔兔的博客</a>
        </li>
    
        
        <li>
            <a href="https://github.com/geekcircle/machine-learning-interview-qa" target="_blank" class="custom-link">machine-learning-interview-qa</a>
        </li>
    
    

    
    <li class="divider"></li>
    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    序言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" >
            
                <span>
            
                    
                    题目
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.2.1" data-path="1.html">
            
                <a href="1.html">
            
                    
                    1. 如何处理特征向量的缺失值
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.2" data-path="2.html">
            
                <a href="2.html">
            
                    
                    2. 请简要说说一个完整机器学习项目的流程
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.3" data-path="3.html">
            
                <a href="3.html">
            
                    
                    3. 某超市研究销售记录发现买啤酒的人很大概率也会买尿布，这属于数据挖掘的哪类问题
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.4" data-path="4.html">
            
                <a href="4.html">
            
                    
                    4. 余弦相似与欧氏距离有什么区别和联系
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.5" data-path="5.html">
            
                <a href="5.html">
            
                    
                    5. 下面哪个不属于数据的属性类型
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.6" data-path="6.html">
            
                <a href="6.html">
            
                    
                    6. 监督学习和无监督学习
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.7" data-path="7.html">
            
                <a href="7.html">
            
                    
                    7. 熵是为消除不确定性所需要获得的信息量，投掷均匀正六面体骰子的熵是
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.2.8" data-path="8.html">
            
                <a href="8.html">
            
                    
                    8. 数据清洗与特征处理
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.9" data-path="9.html">
            
                <a href="9.html">
            
                    
                    9. 猜测这种划分最可能是什么聚类算法的结果
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.10" data-path="10.html">
            
                <a href="10.html">
            
                    
                    10. 支持向量机(SVM)中的支持向量是什么意思
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.11" data-path="11.html">
            
                <a href="11.html">
            
                    
                    11. 精确率（precision）和召回率（recall）
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.12" data-path="12.html">
            
                <a href="12.html">
            
                    
                    12. 数据挖掘中如何判断关联规则有效性
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.13" data-path="13.html">
            
                <a href="13.html">
            
                    
                    13. 朴素贝叶斯分类某个类别概率为0怎么办
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.14" data-path="14.html">
            
                <a href="14.html">
            
                    
                    14. 决策树
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            本书使用 GitBook 发布
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >8. 数据清洗与特征处理</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="8-&#x6570;&#x636E;&#x6E05;&#x6D17;&#x4E0E;&#x7279;&#x5F81;&#x5904;&#x7406;">8. &#x6570;&#x636E;&#x6E05;&#x6D17;&#x4E0E;&#x7279;&#x5F81;&#x5904;&#x7406;</h1>
<h2 id="&#x6570;&#x636E;&#x6E05;&#x6D17;">&#x6570;&#x636E;&#x6E05;&#x6D17;</h2>
<p>&#x6E05;&#x6D17;&#x6807;&#x6CE8;&#x6570;&#x636E;&#xFF0C;&#x4E3B;&#x8981;&#x662F;&#x6570;&#x636E;&#x91C7;&#x6837;&#x548C;&#x6837;&#x672C;&#x8FC7;&#x6EE4;</p>
<p><strong>&#x6570;&#x636E;&#x91C7;&#x6837;</strong></p>
<p>&#x6570;&#x636E;&#x91C7;&#x6837;&#xFF0C;&#x4F8B;&#x5982;&#x5BF9;&#x4E8E;&#x5206;&#x7C7B;&#x95EE;&#x9898;&#xFF1A;&#x9009;&#x53D6;&#x6B63;&#x4F8B;&#xFF0C;&#x8D1F;&#x4F8B;&#x3002;&#x5BF9;&#x4E8E;&#x56DE;&#x5F52;&#x95EE;&#x9898;&#xFF0C;&#x9700;&#x8981;&#x91C7;&#x96C6;&#x6570;&#x636E;&#x3002;&#x5BF9;&#x4E8E;&#x91C7;&#x6837;&#x5F97;&#x5230;&#x7684;&#x6837;&#x672C;&#xFF0C;&#x6839;&#x636E;&#x9700;&#x8981;&#xFF0C;&#x9700;&#x8981;&#x8BBE;&#x5B9A;&#x6837;&#x672C;&#x6743;&#x91CD;&#x3002;&#x5F53;&#x6A21;&#x578B;&#x4E0D;&#x80FD;&#x4F7F;&#x7528;&#x5168;&#x90E8;&#x7684;&#x6570;&#x636E;&#x6765;&#x8BAD;&#x7EC3;&#x65F6;&#xFF0C;&#x9700;&#x8981;&#x5BF9;&#x6570;&#x636E;&#x8FDB;&#x884C;&#x91C7;&#x6837;&#xFF0C;&#x8BBE;&#x5B9A;&#x4E00;&#x5B9A;&#x7684;&#x91C7;&#x6837;&#x7387;&#x3002;&#x91C7;&#x6837;&#x7684;&#x65B9;&#x6CD5;&#x5305;&#x62EC;&#x968F;&#x673A;&#x91C7;&#x6837;&#xFF0C;&#x56FA;&#x5B9A;&#x6BD4;&#x4F8B;&#x91C7;&#x6837;&#x7B49;&#x65B9;&#x6CD5;&#x3002;</p>
<p><strong>&#x6837;&#x672C;&#x8FC7;&#x6EE4;</strong></p>
<p>1.&#x7ED3;&#x5408;&#x4E1A;&#x52A1;&#x60C5;&#x51B5;&#x8FDB;&#x884C;&#x6570;&#x636E;&#x7684;&#x8FC7;&#x6EE4;&#xFF0C;&#x4F8B;&#x5982;&#x53BB;&#x9664;crawler&#x6293;&#x53D6;&#xFF0C;spam&#xFF0C;&#x4F5C;&#x5F0A;&#x7B49;&#x6570;&#x636E;&#x3002;</p>
<p>2.&#x5F02;&#x5E38;&#x70B9;&#x68C0;&#x6D4B;&#xFF0C;&#x91C7;&#x7528;&#x5F02;&#x5E38;&#x70B9;&#x68C0;&#x6D4B;&#x7B97;&#x6CD5;&#x5BF9;&#x6837;&#x672C;&#x8FDB;&#x884C;&#x5206;&#x6790;&#xFF0C;&#x5E38;&#x7528;&#x7684;&#x5F02;&#x5E38;&#x70B9;&#x68C0;&#x6D4B;&#x7B97;&#x6CD5;&#x5305;&#x62EC;&#xFF1A;</p>
<ul>
<li>&#x504F;&#x5DEE;&#x68C0;&#x6D4B;&#xFF0C;&#x4F8B;&#x5982;&#x805A;&#x7C7B;&#xFF0C;&#x6700;&#x8FD1;&#x90BB;&#x7B49;&#x3002;</li>
<li>&#x57FA;&#x4E8E;&#x7EDF;&#x8BA1;&#x7684;&#x5F02;&#x5E38;&#x70B9;&#x68C0;&#x6D4B;&#x7B97;&#x6CD5;
&#x4F8B;&#x5982;&#x6781;&#x5DEE;&#xFF0C;&#x56DB;&#x5206;&#x4F4D;&#x6570;&#x95F4;&#x8DDD;&#xFF0C;&#x5747;&#x5DEE;&#xFF0C;&#x6807;&#x51C6;&#x5DEE;&#x7B49;&#xFF0C;&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x9002;&#x5408;&#x4E8E;&#x6316;&#x6398;&#x5355;&#x53D8;&#x91CF;&#x7684;&#x6570;&#x503C;&#x578B;&#x6570;&#x636E;&#x3002;&#x5168;&#x8DDD;(Range)&#xFF0C;&#x53C8;&#x79F0;&#x6781;&#x5DEE;&#xFF0C;&#x662F;&#x7528;&#x6765;&#x8868;&#x793A;&#x7EDF;&#x8BA1;&#x8D44;&#x6599;&#x4E2D;&#x7684;&#x53D8;&#x5F02;&#x91CF;&#x6570;(measures of variation) &#xFF0C;&#x5176;&#x6700;&#x5927;&#x503C;&#x4E0E;&#x6700;&#x5C0F;&#x503C;&#x4E4B;&#x95F4;&#x7684;&#x5DEE;&#x8DDD;&#xFF1B;&#x56DB;&#x5206;&#x4F4D;&#x8DDD;&#x901A;&#x5E38;&#x662F;&#x7528;&#x6765;&#x6784;&#x5EFA;&#x7BB1;&#x5F62;&#x56FE;&#xFF0C;&#x4EE5;&#x53CA;&#x5BF9;&#x6982;&#x7387;&#x5206;&#x5E03;&#x7684;&#x7B80;&#x8981;&#x56FE;&#x8868;&#x6982;&#x8FF0;&#x3002;</li>
<li>&#x57FA;&#x4E8E;&#x8DDD;&#x79BB;&#x7684;&#x5F02;&#x5E38;&#x70B9;&#x68C0;&#x6D4B;&#x7B97;&#x6CD5;&#xFF0C;&#x4E3B;&#x8981;&#x901A;&#x8FC7;&#x8DDD;&#x79BB;&#x65B9;&#x6CD5;&#x6765;&#x68C0;&#x6D4B;&#x5F02;&#x5E38;&#x70B9;&#xFF0C;&#x5C06;&#x6570;&#x636E;&#x96C6;&#x4E2D;&#x4E0E;&#x5927;&#x591A;&#x6570;&#x70B9;&#x4E4B;&#x95F4;&#x8DDD;&#x79BB;&#x5927;&#x4E8E;&#x67D0;&#x4E2A;&#x9608;&#x503C;&#x7684;&#x70B9;&#x89C6;&#x4E3A;&#x5F02;&#x5E38;&#x70B9;&#xFF0C;&#x4E3B;&#x8981;&#x4F7F;&#x7528;&#x7684;&#x8DDD;&#x79BB;&#x5EA6;&#x91CF;&#x65B9;&#x6CD5;&#x6709;&#x7EDD;&#x5BF9;&#x8DDD;&#x79BB; ( &#x66FC;&#x54C8;&#x987F;&#x8DDD;&#x79BB; ) &#x3001;&#x6B27;&#x6C0F;&#x8DDD;&#x79BB;&#x548C;&#x9A6C;&#x6C0F;&#x8DDD;&#x79BB;&#x7B49;&#x65B9;&#x6CD5;&#x3002;</li>
<li>&#x57FA;&#x4E8E;&#x5BC6;&#x5EA6;&#x7684;&#x5F02;&#x5E38;&#x70B9;&#x68C0;&#x6D4B;&#x7B97;&#x6CD5;&#xFF0C;&#x8003;&#x5BDF;&#x5F53;&#x524D;&#x70B9;&#x5468;&#x56F4;&#x5BC6;&#x5EA6;&#xFF0C;&#x53EF;&#x4EE5;&#x53D1;&#x73B0;&#x5C40;&#x90E8;&#x5F02;&#x5E38;&#x70B9;&#xFF0C;&#x4F8B;&#x5982;LOF&#x7B97;&#x6CD5;</li>
</ul>
<h2 id="&#x7279;&#x5F81;&#x5904;&#x7406;">&#x7279;&#x5F81;&#x5904;&#x7406;</h2>
<h3 id="&#x7279;&#x5F81;&#x5904;&#x7406;&#x4E0E;&#x5206;&#x6790;">&#x7279;&#x5F81;&#x5904;&#x7406;&#x4E0E;&#x5206;&#x6790;</h3>
<p>&#x5728;&#x5BF9;&#x7279;&#x5F81;&#x8FDB;&#x884C;&#x5206;&#x7C7B;&#x540E;&#xFF0C;&#x4E0B;&#x9762;&#x4ECB;&#x7ECD;&#x4E0B;&#x5BF9;&#x7279;&#x5F81;&#x5E38;&#x7528;&#x7684;&#x5904;&#x7406;&#x65B9;&#x6CD5;&#x3002;&#x5305;&#x62EC;1.&#x7279;&#x5F81;&#x5F52;&#x4E00;&#x5316;&#xFF0C;&#x79BB;&#x6563;&#x5316;&#xFF0C;&#x7F3A;&#x7701;&#x503C;&#x5904;&#x7406;&#x3002;2.&#x7279;&#x5F81;&#x964D;&#x7EF4;&#x65B9;&#x6CD5;&#x3002;3.&#x7279;&#x5F81;&#x9009;&#x62E9;&#x65B9;&#x6CD5;&#x7B49;&#x3002;</p>
<p>&#x7279;&#x5F81;&#x5F52;&#x4E00;&#x5316;&#xFF0C;&#x79BB;&#x6563;&#x5316;&#xFF0C;&#x7F3A;&#x7701;&#x503C;&#x5904;&#x7406;
&#x4E3B;&#x8981;&#x7528;&#x4E8E;&#x5355;&#x4E2A;&#x7279;&#x5F81;&#x7684;&#x5904;&#x7406;&#x3002;</p>
<p><strong>&#x5F52;&#x4E00;&#x5316;</strong></p>
<p>&#x4E0D;&#x540C;&#x7684;&#x7279;&#x5F81;&#x6709;&#x4E0D;&#x540C;&#x7684;&#x53D6;&#x503C;&#x8303;&#x56F4;&#xFF0C;&#x5728;&#x6709;&#x4E9B;&#x7B97;&#x6CD5;&#x4E2D;&#xFF0C;&#x4F8B;&#x5982;&#x7EBF;&#x6027;&#x6A21;&#x578B;&#x6216;&#x8005;&#x8DDD;&#x79BB;&#x76F8;&#x5173;&#x7684;&#x6A21;&#x578B;&#x50CF;&#x805A;&#x7C7B;&#x6A21;&#x578B;&#x3001;knn&#x6A21;&#x578B;&#x7B49;&#xFF0C;&#x7279;&#x5F81;&#x7684;&#x53D6;&#x503C;&#x8303;&#x56F4;&#x4F1A;&#x5BF9;&#x6700;&#x7EC8;&#x7684;&#x7ED3;&#x679C;&#x4EA7;&#x751F;&#x8F83;&#x5927;&#x5F71;&#x54CD;&#xFF0C;&#x4F8B;&#x5982;&#x4E8C;&#x5143;&#x7279;&#x5F81;&#x7684;&#x53D6;&#x503C;&#x8303;&#x56F4;&#x4E3A;[0&#xFF0C;1]&#xFF0C;&#x800C;&#x8DDD;&#x79BB;&#x7279;&#x5F81;&#x53D6;&#x503C;&#x53EF;&#x80FD;&#x662F;[0&#xFF0C;&#x6B63;&#x65E0;&#x7A77;)&#xFF0C;&#x5728;&#x5B9E;&#x9645;&#x4F7F;&#x7528;&#x4E2D;&#x4F1A;&#x5BF9;&#x8DDD;&#x79BB;&#x8FDB;&#x884C;&#x622A;&#x65AD;&#xFF0C;&#x4F8B;&#x5982;[0&#xFF0C;3000000]&#xFF0C;&#x4F46;&#x662F;&#x8FD9;&#x4E24;&#x4E2A;&#x7279;&#x5F81;&#x7531;&#x4E8E;&#x53D6;&#x503C;&#x8303;&#x56F4;&#x4E0D;&#x4E00;&#x81F4;&#x5BFC;&#x81F4;&#x4E86;&#x6A21;&#x578B;&#x53EF;&#x80FD;&#x4F1A;&#x66F4;&#x504F;&#x5411;&#x4E8E;&#x53D6;&#x503C;&#x8303;&#x56F4;&#x8F83;&#x5927;&#x7684;&#x7279;&#x5F81;&#xFF0C;&#x4E3A;&#x4E86;&#x5E73;&#x8861;&#x53D6;&#x503C;&#x8303;&#x56F4;&#x4E0D;&#x4E00;&#x81F4;&#x7684;&#x7279;&#x5F81;&#xFF0C;&#x9700;&#x8981;&#x5BF9;&#x7279;&#x5F81;&#x8FDB;&#x884C;&#x5F52;&#x4E00;&#x5316;&#x5904;&#x7406;&#xFF0C;&#x5C06;&#x7279;&#x5F81;&#x53D6;&#x503C;&#x5F52;&#x4E00;&#x5316;&#x5230;&#xFF3B;0&#xFF0C;1&#xFF3D;&#x533A;&#x95F4;&#x3002;&#x5E38;&#x7528;&#x7684;&#x5F52;&#x4E00;&#x5316;&#x65B9;&#x6CD5;&#x5305;&#x62EC;1.&#x51FD;&#x6570;&#x5F52;&#x4E00;&#x5316;&#xFF0C;&#x901A;&#x8FC7;&#x6620;&#x5C04;&#x51FD;&#x6570;&#x5C06;&#x7279;&#x5F81;&#x53D6;&#x503C;&#x6620;&#x5C04;&#x5230;&#xFF3B;0&#xFF0C;1&#xFF3D;&#x533A;&#x95F4;&#xFF0C;&#x4F8B;&#x5982;&#x6700;&#x5927;&#x6700;&#x5C0F;&#x503C;&#x5F52;&#x4E00;&#x5316;&#x65B9;&#x6CD5;&#xFF0C;&#x662F;&#x4E00;&#x79CD;&#x7EBF;&#x6027;&#x7684;&#x6620;&#x5C04;&#x3002;&#x8FD8;&#x6709;&#x901A;&#x8FC7;&#x975E;&#x7EBF;&#x6027;&#x51FD;&#x6570;&#x7684;&#x6620;&#x5C04;&#xFF0C;&#x4F8B;&#x5982;log&#x51FD;&#x6570;&#x7B49;&#x3002;2.&#x5206;&#x7EF4;&#x5EA6;&#x5F52;&#x4E00;&#x5316;&#xFF0C;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x6700;&#x5927;&#x6700;&#x5C0F;&#x5F52;&#x4E00;&#x5316;&#x65B9;&#x6CD5;&#xFF0C;&#x4F46;&#x662F;&#x6700;&#x5927;&#x6700;&#x5C0F;&#x503C;&#x9009;&#x53D6;&#x7684;&#x662F;&#x6240;&#x5C5E;&#x7C7B;&#x522B;&#x7684;&#x6700;&#x5927;&#x6700;&#x5C0F;&#x503C;&#xFF0C;&#x5373;&#x4F7F;&#x7528;&#x7684;&#x662F;&#x5C40;&#x90E8;&#x6700;&#x5927;&#x6700;&#x5C0F;&#x503C;&#xFF0C;&#x4E0D;&#x662F;&#x5168;&#x5C40;&#x7684;&#x6700;&#x5927;&#x6700;&#x5C0F;&#x503C;&#x3002;3.&#x6392;&#x5E8F;&#x5F52;&#x4E00;&#x5316;&#xFF0C;&#x4E0D;&#x7BA1;&#x539F;&#x6765;&#x7684;&#x7279;&#x5F81;&#x53D6;&#x503C;&#x662F;&#x4EC0;&#x4E48;&#x6837;&#x7684;&#xFF0C;&#x5C06;&#x7279;&#x5F81;&#x6309;&#x5927;&#x5C0F;&#x6392;&#x5E8F;&#xFF0C;&#x6839;&#x636E;&#x7279;&#x5F81;&#x6240;&#x5BF9;&#x5E94;&#x7684;&#x5E8F;&#x7ED9;&#x4E88;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x503C;&#x3002;</p>
<p><strong>&#x79BB;&#x6563;&#x5316;</strong></p>
<p>&#x5728;&#x4E0A;&#x9762;&#x4ECB;&#x7ECD;&#x8FC7;&#x8FDE;&#x7EED;&#x503C;&#x7684;&#x53D6;&#x503C;&#x7A7A;&#x95F4;&#x53EF;&#x80FD;&#x662F;&#x65E0;&#x7A77;&#x7684;&#xFF0C;&#x4E3A;&#x4E86;&#x4FBF;&#x4E8E;&#x8868;&#x793A;&#x548C;&#x5728;&#x6A21;&#x578B;&#x4E2D;&#x5904;&#x7406;&#xFF0C;&#x9700;&#x8981;&#x5BF9;&#x8FDE;&#x7EED;&#x503C;&#x7279;&#x5F81;&#x8FDB;&#x884C;&#x79BB;&#x6563;&#x5316;&#x5904;&#x7406;&#x3002;&#x5E38;&#x7528;&#x7684;&#x79BB;&#x6563;&#x5316;&#x65B9;&#x6CD5;&#x5305;&#x62EC;&#x7B49;&#x503C;&#x5212;&#x5206;&#x548C;&#x7B49;&#x91CF;&#x5212;&#x5206;&#x3002;&#x7B49;&#x503C;&#x5212;&#x5206;&#x662F;&#x5C06;&#x7279;&#x5F81;&#x6309;&#x7167;&#x503C;&#x57DF;&#x8FDB;&#x884C;&#x5747;&#x5206;&#xFF0C;&#x6BCF;&#x4E00;&#x6BB5;&#x5185;&#x7684;&#x53D6;&#x503C;&#x7B49;&#x540C;&#x5904;&#x7406;&#x3002;&#x4F8B;&#x5982;&#x67D0;&#x4E2A;&#x7279;&#x5F81;&#x7684;&#x53D6;&#x503C;&#x8303;&#x56F4;&#x4E3A;[0&#xFF0C;10]&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5C06;&#x5176;&#x5212;&#x5206;&#x4E3A;10&#x6BB5;&#xFF0C;[0&#xFF0C;1)&#xFF0C;[1&#xFF0C;2)&#xFF0C;...&#xFF0C;[9&#xFF0C;10)&#x3002;&#x7B49;&#x91CF;&#x5212;&#x5206;&#x662F;&#x6839;&#x636E;&#x6837;&#x672C;&#x603B;&#x6570;&#x8FDB;&#x884C;&#x5747;&#x5206;&#xFF0C;&#x6BCF;&#x6BB5;&#x7B49;&#x91CF;&#x4E2A;&#x6837;&#x672C;&#x5212;&#x5206;&#x4E3A;1&#x6BB5;&#x3002;&#x4F8B;&#x5982;&#x8DDD;&#x79BB;&#x7279;&#x5F81;&#xFF0C;&#x53D6;&#x503C;&#x8303;&#x56F4;&#xFF3B;0&#xFF0C;3000000&#xFF3D;&#xFF0C;&#x73B0;&#x5728;&#x9700;&#x8981;&#x5207;&#x5206;&#x6210;10&#x6BB5;&#xFF0C;&#x5982;&#x679C;&#x6309;&#x7167;&#x7B49;&#x6BD4;&#x4F8B;&#x5212;&#x5206;&#x7684;&#x8BDD;&#xFF0C;&#x4F1A;&#x53D1;&#x73B0;&#x7EDD;&#x5927;&#x90E8;&#x5206;&#x6837;&#x672C;&#x90FD;&#x5728;&#x7B2C;1&#x6BB5;&#x4E2D;&#x3002;&#x4F7F;&#x7528;&#x7B49;&#x91CF;&#x5212;&#x5206;&#x5C31;&#x4F1A;&#x907F;&#x514D;&#x8FD9;&#x79CD;&#x95EE;&#x9898;&#xFF0C;&#x6700;&#x7EC8;&#x53EF;&#x80FD;&#x7684;&#x5207;&#x5206;&#x662F;[0&#xFF0C;100)&#xFF0C;[100&#xFF0C;300)&#xFF0C;[300&#xFF0C;500)&#xFF0C;..&#xFF0C;[10000&#xFF0C;3000000]&#xFF0C;&#x524D;&#x9762;&#x7684;&#x533A;&#x95F4;&#x5212;&#x5206;&#x6BD4;&#x8F83;&#x5BC6;&#xFF0C;&#x540E;&#x9762;&#x7684;&#x6BD4;&#x8F83;&#x7A00;&#x758F;&#x3002;</p>
<p><strong>&#x7F3A;&#x7701;&#x503C;&#x5904;&#x7406;</strong></p>
<p>&#x6709;&#x4E9B;&#x7279;&#x5F81;&#x53EF;&#x80FD;&#x56E0;&#x4E3A;&#x65E0;&#x6CD5;&#x91C7;&#x6837;&#x6216;&#x8005;&#x6CA1;&#x6709;&#x89C2;&#x6D4B;&#x503C;&#x800C;&#x7F3A;&#x5931;&#xFF0C;&#x4F8B;&#x5982;&#x8DDD;&#x79BB;&#x7279;&#x5F81;&#xFF0C;&#x7528;&#x6237;&#x53EF;&#x80FD;&#x7981;&#x6B62;&#x83B7;&#x53D6;&#x5730;&#x7406;&#x4F4D;&#x7F6E;&#x6216;&#x8005;&#x83B7;&#x53D6;&#x5730;&#x7406;&#x4F4D;&#x7F6E;&#x5931;&#x8D25;&#xFF0C;&#x6B64;&#x65F6;&#x9700;&#x8981;&#x5BF9;&#x8FD9;&#x4E9B;&#x7279;&#x5F81;&#x505A;&#x7279;&#x6B8A;&#x7684;&#x5904;&#x7406;&#xFF0C;&#x8D4B;&#x4E88;&#x4E00;&#x4E2A;&#x7F3A;&#x7701;&#x503C;&#x3002;&#x7F3A;&#x7701;&#x503C;&#x5982;&#x4F55;&#x8D4B;&#x4E88;&#xFF0C;&#x4E5F;&#x6709;&#x5F88;&#x591A;&#x79CD;&#x65B9;&#x6CD5;&#x3002;&#x4F8B;&#x5982;&#x5355;&#x72EC;&#x8868;&#x793A;&#xFF0C;&#x4F17;&#x6570;&#xFF0C;&#x5E73;&#x5747;&#x503C;&#x7B49;&#x3002;</p>
<p><img src="image/8.&#x6570;&#x636E;&#x6E05;&#x6D17;&#x4E0E;&#x7279;&#x5F81;&#x5904;&#x7406;.jpg" alt="&#x6570;&#x636E;&#x6E05;&#x6D17;&#x4E0E;&#x7279;&#x5F81;&#x5904;&#x7406;"></p>
<h3 id="&#x53C2;&#x8003;">&#x53C2;&#x8003;</h3>
<p><a href="https://tech.meituan.com/machinelearning-data-feature-process.html" target="_blank">https://tech.meituan.com/machinelearning-data-feature-process.html</a></p>
<footer class="page-footer-ex"> <span class="page-footer-ex-copyright"> <a href="https://github.com/geekcircle" target="_blank">geekcircle</a> </span> &#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; <span class="page-footer-ex-footer-update"> <strong>updated</strong> 2018-05-24 00:28:47 </span> </footer>
                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="7.html" class="navigation navigation-prev " aria-label="Previous page: 7. 熵是为消除不确定性所需要获得的信息量，投掷均匀正六面体骰子的熵是">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="9.html" class="navigation navigation-next " aria-label="Next page: 9. 猜测这种划分最可能是什么聚类算法的结果">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"8. 数据清洗与特征处理","level":"1.2.8","depth":2,"next":{"title":"9. 猜测这种划分最可能是什么聚类算法的结果","level":"1.2.9","depth":2,"path":"questions/9.md","ref":"questions/9.md","articles":[]},"previous":{"title":"7. 熵是为消除不确定性所需要获得的信息量，投掷均匀正六面体骰子的熵是","level":"1.2.7","depth":2,"path":"questions/7.md","ref":"questions/7.md","articles":[]},"dir":"ltr"},"config":{"plugins":["-highlight","expandable-chapters","splitter","page-footer-ex","prism","github","github-buttons","sitemap-general"],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"prism":{},"github":{"url":"https://github.com/geekcircle/machine-learning-interview-qa"},"page-footer-ex":{"copyright":"[geekcircle](https://github.com/geekcircle)","markdown":true,"update_format":"YYYY-MM-DD HH:mm:ss","update_label":"<strong>updated</strong>"},"splitter":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sitemap-general":{"prefix":"https://geekcircle.github.io/machine-learning-interview-qa/"},"fontsettings":{"theme":"white","family":"sans","size":2},"github-buttons":{"buttons":[{"user":"geekcircle","repo":"machine-learning-interview-qa","type":"star","size":"large"}]},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false},"expandable-chapters":{}},"theme":"default","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"机器学习面试笔试题 - 极客圈","language":"zh-hans","links":{"sidebar":{"极客兔兔的博客":"https://geektutu.com/series","machine-learning-interview-qa":"https://github.com/geekcircle/machine-learning-interview-qa"}},"gitbook":"*","description":"持续整理机器学习面试笔试题"},"file":{"path":"questions/8.md","mtime":"2018-05-23T16:28:47.772Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2018-06-13T16:44:53.625Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-expandable-chapters/expandable-chapters.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-splitter/splitter.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-github/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-github-buttons/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

